robbym/llvm-project/llvm/lib/Target/DSPIC/DSPICISelLowering.cpp
//===-- DSPICISelLowering.cpp - DSPIC DAG Lowering Implementation  ------===//
//
// Part of the LLVM Project, under the Apache License v2.0 with LLVM Exceptions.
// See https://llvm.org/LICENSE.txt for license information.
// SPDX-License-Identifier: Apache-2.0 WITH LLVM-exception
//
//===----------------------------------------------------------------------===//
//
// This file implements the DSPICTargetLowering class.
//
//===----------------------------------------------------------------------===//

#include "DSPICISelLowering.h"
#include "MCTargetDesc/DSPICMCAsmInfo.h"
#include "DSPIC.h"
#include "DSPICMachineFunctionInfo.h"
#include "DSPICSelectionDAGInfo.h"
#include "DSPICSubtarget.h"
#include "DSPICTargetMachine.h"
#include "llvm/CodeGen/CallingConvLower.h"
#include "llvm/CodeGen/MachineFrameInfo.h"
#include "llvm/CodeGen/MachineFunction.h"
#include "llvm/CodeGen/MachineInstrBuilder.h"
#include "llvm/CodeGen/MachineRegisterInfo.h"
#include "llvm/CodeGen/TargetLoweringObjectFileImpl.h"
#include "llvm/CodeGen/ValueTypes.h"
#include "llvm/IR/CallingConv.h"
#include "llvm/IR/DerivedTypes.h"
#include "llvm/IR/Function.h"
#include "llvm/IR/Intrinsics.h"
#include "llvm/Support/CommandLine.h"
#include "llvm/Support/MathExtras.h"
#include "llvm/Support/KnownBits.h"
#include "llvm/Support/Debug.h"
#include "llvm/Support/ErrorHandling.h"
#include "llvm/Support/raw_ostream.h"
using namespace llvm;

#define DEBUG_TYPE "dspic-lower"

static cl::opt<bool>DSPICNoLegalImmediate(
  "dspic-dspic-no-legal-immediate", cl::Hidden,
  cl::desc("Enable non legal immediates (for testing purposes only)"),
  cl::init(false));

DSPICTargetLowering::DSPICTargetLowering(const TargetMachine &TM,
                                           const DSPICSubtarget &STI)
    : TargetLowering(TM, STI) {

  // Set up the register classes.
  addRegisterClass(MVT::i8,  &DSPIC::GR8RegClass);
  addRegisterClass(MVT::i16, &DSPIC::GR16RegClass);

  // Compute derived properties from the register classes
  computeRegisterProperties(STI.getRegisterInfo());

  // Provide all sorts of operation actions
  setStackPointerRegisterToSaveRestore(DSPIC::SP);
  setBooleanContents(ZeroOrOneBooleanContent);
  setBooleanVectorContents(ZeroOrOneBooleanContent); // FIXME: Is this correct?

  // L1f-f (trellis session 87): every addressing mode dsPIC has on a load and on a store --
  // [Wn++], [Wn--], [++Wn], [--Wn] -- is an indexed node; the isel arms print them.
  for (auto AM : {ISD::POST_INC, ISD::POST_DEC, ISD::PRE_INC, ISD::PRE_DEC})
    for (MVT VT : {MVT::i8, MVT::i16}) {
      setIndexedLoadAction(AM, VT, Legal);
      setIndexedStoreAction(AM, VT, Legal);
    }

  for (MVT VT : MVT::integer_valuetypes()) {
    setLoadExtAction(ISD::EXTLOAD,  VT, MVT::i1,  Promote);
    setLoadExtAction(ISD::SEXTLOAD, VT, MVT::i1,  Promote);
    setLoadExtAction(ISD::ZEXTLOAD, VT, MVT::i1,  Promote);
    setLoadExtAction(ISD::SEXTLOAD, VT, MVT::i8,  Expand);
    setLoadExtAction(ISD::SEXTLOAD, VT, MVT::i16, Expand);
  }

  // We don't have any truncstores
  setTruncStoreAction(MVT::i16, MVT::i8, Expand);

  // L1f-c: i8 shifts stay Custom (the fold of an amount >= 8 in LowerShifts) and select
  // through the word forms by pattern (the .td); a lowering through i16 looped with the
  // combiner, and Promote does not reach a shift of a legal type.
  setOperationAction(ISD::SRA,              MVT::i8,    Custom);
  setOperationAction(ISD::SHL,              MVT::i8,    Custom);
  setOperationAction(ISD::SRL,              MVT::i8,    Custom);
  setOperationAction(ISD::SRA,              MVT::i16,   Custom);
  setOperationAction(ISD::SHL,              MVT::i16,   Custom);
  setOperationAction(ISD::SRL,              MVT::i16,   Custom);
  // L1f-c: a rotate by one is `rlnc`/`rrnc`; any other amount falls through to Expand.
  setOperationAction(ISD::ROTL,             MVT::i8,    Custom);
  setOperationAction(ISD::ROTR,             MVT::i8,    Custom);
  setOperationAction(ISD::ROTL,             MVT::i16,   Custom);
  setOperationAction(ISD::ROTR,             MVT::i16,   Custom);
  setOperationAction(ISD::GlobalAddress,    MVT::i16,   Custom);
  // L1e prog-space: an addrspace(1) global address is i32 (page:offset); LowerGlobalAddress
  // splits it into tbloffset/tblpage, so it must be Custom too (else the legalizer expands it).
  setOperationAction(ISD::GlobalAddress,    MVT::i32,   Custom);
  setOperationAction(ISD::ExternalSymbol,   MVT::i16,   Custom);
  setOperationAction(ISD::BlockAddress,     MVT::i16,   Custom);
  setOperationAction(ISD::BR_JT,            MVT::Other, Expand);
  setOperationAction(ISD::BR_CC,            MVT::i8,    Custom);
  setOperationAction(ISD::BR_CC,            MVT::i16,   Custom);
  setOperationAction(ISD::BRCOND,           MVT::Other, Expand);
  setOperationAction(ISD::SETCC,            MVT::i8,    Custom);
  setOperationAction(ISD::SETCC,            MVT::i16,   Custom);
  setOperationAction(ISD::SELECT,           MVT::i8,    Expand);
  setOperationAction(ISD::SELECT,           MVT::i16,   Expand);
  setOperationAction(ISD::SELECT_CC,        MVT::i8,    Custom);
  setOperationAction(ISD::SELECT_CC,        MVT::i16,   Custom);
  // L1f-k (trellis session 92): a 32-bit compare is an ILLEGAL-typed OPERAND the integer type
  // legalizer would expand into two i16 compares joined by a select (~10 words). Custom on the
  // operand type is consulted FIRST (ExpandIntegerOperand -> CustomLowerNode; the AVR recipe),
  // and EmitCMP fuses it to `cp lo ; cpb hi ; bra cc`. A SELECT_CC with an i32 RESULT declines
  // (ReplaceNodeResults) and the legalizer splits it into two i16 selects.
  setOperationAction(ISD::BR_CC,            MVT::i32,   Custom);
  setOperationAction(ISD::SETCC,            MVT::i32,   Custom);
  setOperationAction(ISD::SELECT_CC,        MVT::i32,   Custom);
  // L1f-k: an i32 min/max (InstCombine's spelling of `a < b ? a : b`) is expanded by the type
  // legalizer ITSELF, after the combiner; Custom routes it to ReplaceNodeResults as a SELECT_CC.
  for (unsigned Op : {ISD::UMIN, ISD::UMAX, ISD::SMIN, ISD::SMAX})
    setOperationAction(Op, MVT::i32, Custom);
  setOperationAction(ISD::SIGN_EXTEND,      MVT::i16,   Custom);
  setOperationAction(ISD::DYNAMIC_STACKALLOC, MVT::i8, Expand);
  setOperationAction(ISD::DYNAMIC_STACKALLOC, MVT::i16, Expand);
  setOperationAction(ISD::STACKSAVE,        MVT::Other, Expand);
  setOperationAction(ISD::STACKRESTORE,     MVT::Other, Expand);

  setOperationAction(ISD::CTTZ,             MVT::i8,    Expand);
  setOperationAction(ISD::CTTZ,             MVT::i16,   Expand);
  setOperationAction(ISD::CTLZ,             MVT::i8,    Expand);
  setOperationAction(ISD::CTLZ,             MVT::i16,   Expand);
  // L1f-g: `ff1l`/`ff1r` are one word each (1-based, so a decrement follows); the builtins
  // are undefined at zero, which is exactly the _ZERO_POISON form (upstream's name for _ZERO_UNDEF). CTLZ/CTTZ stay Expand.
  setOperationAction(ISD::CTLZ_ZERO_POISON,  MVT::i16,   Legal);
  setOperationAction(ISD::CTTZ_ZERO_POISON,  MVT::i16,   Legal);
  setOperationAction(ISD::CTPOP,            MVT::i8,    Expand);
  setOperationAction(ISD::CTPOP,            MVT::i16,   Expand);

  setOperationAction(ISD::SHL_PARTS,        MVT::i8,    Expand);
  setOperationAction(ISD::SHL_PARTS,        MVT::i16,   Expand);
  setOperationAction(ISD::SRL_PARTS,        MVT::i8,    Expand);
  setOperationAction(ISD::SRL_PARTS,        MVT::i16,   Expand);
  setOperationAction(ISD::SRA_PARTS,        MVT::i8,    Expand);
  setOperationAction(ISD::SRA_PARTS,        MVT::i16,   Expand);

  setOperationAction(ISD::SIGN_EXTEND_INREG, MVT::i1,   Expand);

