robbym/llvm-project/llvm/lib/Target/DSPIC/DSPICISelLowering.cpp
  // L1f-d increment 2 (trellis session 86): the glue-carry nodes are Legal, so the integer
  // type legalizer splits an i32 add/sub into add;addc / sub;subb (the .td patterns) rather
  // than a UADDO_CARRY chain that lowers to a compare diamond. The AVR recipe.
  for (MVT VT : {MVT::i8, MVT::i16}) {
    setOperationAction(ISD::ADDC, VT, Legal);
    setOperationAction(ISD::ADDE, VT, Legal);
    setOperationAction(ISD::SUBC, VT, Legal);
    setOperationAction(ISD::SUBE, VT, Legal);
  }

  // FIXME: Implement efficiently multiplication by a constant
  setOperationAction(ISD::MUL,              MVT::i8,    Promote);
  setOperationAction(ISD::MULHS,            MVT::i8,    Promote);
  setOperationAction(ISD::MULHU,            MVT::i8,    Promote);
  setOperationAction(ISD::SMUL_LOHI,        MVT::i8,    Promote);
  setOperationAction(ISD::UMUL_LOHI,        MVT::i8,    Promote);
  // L1f-d: i16 multiply is the hardware `mulw` (one word), not the MSP430 libcall.
  setOperationAction(ISD::MUL,              MVT::i16,   Legal);
  setOperationAction(ISD::MULHS,            MVT::i16,   Expand);
  setOperationAction(ISD::MULHU,            MVT::i16,   Expand);
  // L1f-d increment 3 (trellis session 86): the widening multiply is `mul.ss`/`mul.uu`
  // (a pair result), selected by a custom-inserter pseudo fixing the pair at w0:w1.
  setOperationAction(ISD::SMUL_LOHI,        MVT::i16,   Legal);
  setOperationAction(ISD::UMUL_LOHI,        MVT::i16,   Legal);

  setOperationAction(ISD::UDIV,             MVT::i8,    Promote);
  setOperationAction(ISD::UDIVREM,          MVT::i8,    Promote);
  setOperationAction(ISD::UREM,             MVT::i8,    Promote);
  setOperationAction(ISD::SDIV,             MVT::i8,    Promote);
  setOperationAction(ISD::SDIVREM,          MVT::i8,    Promote);
  setOperationAction(ISD::SREM,             MVT::i8,    Promote);
  // L1f-d increment 4 (trellis session 86): the hardware divide is `repeat`+`div.uw`/`div.sw`
  // (quotient w0, remainder w1); the four div/rem Expand so the combiner forms DIVREM.
  setOperationAction(ISD::UDIV,             MVT::i16,   Expand);
  setOperationAction(ISD::UDIVREM,          MVT::i16,   Custom);
  setOperationAction(ISD::UREM,             MVT::i16,   Expand);
  setOperationAction(ISD::SDIV,             MVT::i16,   Expand);
  setOperationAction(ISD::SDIVREM,          MVT::i16,   Custom);
  setOperationAction(ISD::SREM,             MVT::i16,   Expand);

  // varargs support
  setOperationAction(ISD::VASTART,          MVT::Other, Custom);
  setOperationAction(ISD::VAARG,            MVT::Other, Expand);
  setOperationAction(ISD::VAEND,            MVT::Other, Expand);
  setOperationAction(ISD::VACOPY,           MVT::Other, Expand);
  setOperationAction(ISD::JumpTable,        MVT::i16,   Custom);

  // L1f-f: the i32 shift-by-one pair is recovered from the `or` the type legalizer leaves
  setTargetDAGCombine(ISD::OR);
  // L1e prog-space: fold an addrspace(1) i16 read into the PSV-window node before the wide
  // (i32) program pointer reaches type legalization.
  setTargetDAGCombine(ISD::LOAD);
  // L1f-k (trellis session 92): BRCOND(SETCC i32) -> BR_CC and SELECT(SETCC i32) -> SELECT_CC by
  // hand -- the generic folds require a LEGAL comparand type, and i32 is not one here.
  setTargetDAGCombine(ISD::BRCOND);
  setTargetDAGCombine(ISD::SELECT);
  // (session 92, the libcalls row) a commutative op that becomes a runtime routine takes its
  // operands in ARGUMENT order, so the routine's registers are already loaded.
  setTargetDAGCombine({ISD::MUL, ISD::FADD, ISD::FMUL});

  setMinFunctionAlignment(Align(2));
  setPrefFunctionAlignment(Align(2));
  setMaxAtomicSizeInBitsSupported(0);
}

SDValue DSPICTargetLowering::LowerOperation(SDValue Op,
                                             SelectionDAG &DAG) const {
  switch (Op.getOpcode()) {
  case ISD::SHL: // FALLTHROUGH
  case ISD::SRL:
  case ISD::SRA:
  case ISD::ROTL:
  case ISD::ROTR:             return LowerShifts(Op, DAG);
  case ISD::UDIVREM:
  case ISD::SDIVREM:          return LowerDivRem(Op, DAG);
  case ISD::GlobalAddress:    return LowerGlobalAddress(Op, DAG);
  case ISD::BlockAddress:     return LowerBlockAddress(Op, DAG);
  case ISD::ExternalSymbol:   return LowerExternalSymbol(Op, DAG);
  case ISD::SETCC:            return LowerSETCC(Op, DAG);
  case ISD::BR_CC:            return LowerBR_CC(Op, DAG);
  case ISD::SELECT_CC:        return LowerSELECT_CC(Op, DAG);
  case ISD::SIGN_EXTEND:      return LowerSIGN_EXTEND(Op, DAG);
  case ISD::RETURNADDR:       return LowerRETURNADDR(Op, DAG);
  case ISD::FRAMEADDR:        return LowerFRAMEADDR(Op, DAG);
  case ISD::VASTART:          return LowerVASTART(Op, DAG);
  case ISD::JumpTable:        return LowerJumpTable(Op, DAG);
  default:
    llvm_unreachable("unimplemented operand");
  }
}

// Define non profitable transforms into shifts
bool DSPICTargetLowering::shouldAvoidTransformToShift(EVT VT,
                                                       unsigned Amount) const {
  // L1f-c: every shift by a literal is one word; nothing is unprofitable.
  return false;
}

// Implemented to verify test case assertions in
// tests/codegen/dspic/shift-amount-threshold-b.ll
bool DSPICTargetLowering::isLegalICmpImmediate(int64_t Immed) const {
  if (DSPICNoLegalImmediate)
    return Immed >= -32 && Immed < 32;
  return TargetLowering::isLegalICmpImmediate(Immed);
}

//===----------------------------------------------------------------------===//
//                       DSPIC Inline Assembly Support
//===----------------------------------------------------------------------===//

/// getConstraintType - Given a constraint letter, return the type of
/// constraint it is for this target.
TargetLowering::ConstraintType
DSPICTargetLowering::getConstraintType(StringRef Constraint) const {
  if (Constraint.size() == 1) {
    switch (Constraint[0]) {
    case 'r':
      return C_RegisterClass;
    default:
      break;
    }
  }
  return TargetLowering::getConstraintType(Constraint);
}

