robbym/llvm-project/llvm/lib/Target/DSPIC/DSPICISelLowering.cpp
std::pair<unsigned, const TargetRegisterClass *>
DSPICTargetLowering::getRegForInlineAsmConstraint(
    const TargetRegisterInfo *TRI, StringRef Constraint, MVT VT) const {
  if (Constraint.size() == 1) {
    // GCC Constraint Letters
    switch (Constraint[0]) {
    default: break;
    case 'r':   // GENERAL_REGS
      if (VT == MVT::i8)
        return std::make_pair(0U, &DSPIC::GR8RegClass);

      return std::make_pair(0U, &DSPIC::GR16RegClass);
    }
  }

  return TargetLowering::getRegForInlineAsmConstraint(TRI, Constraint, VT);
}

//===----------------------------------------------------------------------===//
//                      Calling Convention Implementation
//===----------------------------------------------------------------------===//

#define GET_CALLING_CONV_IMPL
#include "DSPICGenCallingConv.inc"

/// For each argument in a function store the number of pieces it is composed
/// of.
template<typename ArgT>
static void ParseFunctionArgs(const SmallVectorImpl<ArgT> &Args,
                              SmallVectorImpl<unsigned> &Out) {
  unsigned CurrentArgIndex;

  if (Args.empty())
    return;

  CurrentArgIndex = Args[0].OrigArgIndex;
  Out.push_back(0);

  for (auto &Arg : Args) {
    if (CurrentArgIndex == Arg.OrigArgIndex) {
      Out.back() += 1;
    } else {
      Out.push_back(1);
      CurrentArgIndex = Arg.OrigArgIndex;
    }
  }
}

//===----------------------------------------------------------------------===//
// The dsPIC33 calling convention (trellis L1c, session 85), MEASURED from the pic30 cc1
// (tools/dspic-llvm/prints/l1c/cc1/: abi.c, abi2.c and their -O2/-O0 .s), never designed:
//
//   * w0-w7 carry arguments. An argument of P words (P = 1, 2, 4) takes the LOWEST free run
//     of P registers whose first index is a multiple of P: an i16 or i8 the lowest free
//     register, an i32 the lowest free even pair, an i64 the lowest free quad. A hole an
//     aligned argument skipped is filled by a later smaller one (`l1(int, long, int)`:
//     w0, w2:w3, w1), and an argument that finds no run goes to the stack without closing
//     the registers to those after it (`tail_fit`: the long on the stack, the int after
//     it in w7). Little-endian parts: the low word in the even register.
//   * A byte travels in the low byte of its register or slot, UNEXTENDED: the callee
//     `se`s or `ze`s it (`bytes`: `se w1,w1 / ze w2,w2`; `call_bytes`: `mov.b #97,w1`).
//   * Stack arguments sit just below the return address, the FIRST stack argument nearest
//     it: an argument of S bytes whose predecessors on the stack total O bytes occupies
//     [entrySP-4-O-S, entrySP-4-O). The caller lays the same bytes out at [w15-N, w15), N
//     the total, the LAST stack argument at w15-N (`call_ten` pushes 10 then 9; `ten_def`
//     reads 9 at [entrySP-6] and 10 at [entrySP-8]), and pops N after the call. A word
//     slot holds a byte in its low half (`nine_bytes`: `mov.b [w15-8],w2`).
//   * Results: w0, w0:w1, w0:w3; a byte unextended in w0. A struct result goes through a
//     pointer passed in w0 as the first argument, and the callee returns that pointer in w0
//     (`fwd`: `mov.w w0,w8 ... rcall _mk3 / mov.w w8,w0`).
//
// Here a location's LocMemOffset is the REAL offset in the caller's outgoing area (0 = the
// last stack argument), so the callee's fixed object for it sits at LocMemOffset - N - 4
// from the entry w15, and the caller stores it at w15 + LocMemOffset - N.
//
// The domain of the measurement (the refuter's row, session 85): -mcpu=33CK256MP508, the
// default memory model, over i8/i16/pointer/i32/i64 scalars with at most one stack
// argument or two i16 stack arguments; all-int structs of 2, 3 and 5 words by value
// starting at w0; 4- and 6-byte struct results; no varargs, no floats, no i64 in first
// position, no struct that does not fit. Outside it the rule is this code's extrapolation,
// and the fatal errors below are where it refuses to guess. Which stack slot is the 9th
// argument is decided by `ten_to_two` (`two(i, j)`: `[w15-8]` -> w0) and `ten_def` at -O0,
// not by `ten_def` at -O2, whose add is commutative.
//
// A tail call is `bra _sym` / `goto wN` -- the frame does not grow -- iff (the compatible-
// frame rule, written before it was coded; BACKEND-PLAN.md L1c):
//   1. it is in tail position (LLVM's `musttail`, or `tail` found in position);
//   2. caller and callee use the C convention (`ccc`, `fastcc` and `tailcc` are ONE
//      convention here; `tailcc` exists because the IR verifier admits `musttail` between
//      different prototypes only under it) and neither is variadic;
//   3. no argument is passed `byval`;
//   4. the callee's stack-argument bytes do not exceed the caller's INCOMING stack-argument
//      bytes: the return address stays where the caller's caller put it, and that caller
//      pops exactly what it pushed, so the callee's arguments are written over the top of
//      the caller's own incoming area -- each slot read before it is overwritten (the DAG
//      chains every store after every argument load; the -O2 text is per slot) -- and
//      nothing below moves;
//      (no cc1 output exhibits this overwrite -- cc1 never sibcalls out of a function with
//      incoming stack arguments -- so its correctness rests on this arithmetic, the fixture's
//      hand trace and the assembler's acceptance, not on a reference);
//   5. an indirect target has a caller-saved register to live in across the epilogue's
//      pops, i.e. fewer than eight words of register arguments.
// Then: register arguments into w0-w7; stack arguments into the caller's incoming slots;
// the epilogue (`ulnk`, the pops); `bra`/`goto`. A `musttail` failing a clause is a fatal
// error naming it, never a frame.
//===----------------------------------------------------------------------===//

// The eight argument registers in w order, and the byte registers under them.
static const MCPhysReg ArgRegs16[8] = {DSPIC::R12, DSPIC::R13, DSPIC::R14,
                                       DSPIC::R15, DSPIC::R11, DSPIC::W5,
                                       DSPIC::W6,  DSPIC::W7};
static const MCPhysReg ArgRegs8[8] = {DSPIC::R12B, DSPIC::R13B, DSPIC::R14B,
                                      DSPIC::R15B, DSPIC::R11B, DSPIC::W5B,
                                      DSPIC::W6B,  DSPIC::W7B};

