robbym/llvm-project/llvm/lib/Target/DSPIC/DSPICISelLowering.cpp
// The lowest free run of Parts registers aligned to Parts, or -1.
static int lowestFreeRun(unsigned Used, unsigned Parts) {
  for (unsigned I = 0; I + Parts <= 8; I += Parts) {
    unsigned Mask = ((1u << Parts) - 1) << I;
    if ((Used & Mask) == 0)
      return I;
  }
  return -1;
}

template <typename ArgT>
static void AnalyzeArguments(CCState &State,
                             SmallVectorImpl<CCValAssign> &ArgLocs,
                             const SmallVectorImpl<ArgT> &Args) {
  if (State.isVarArg())
    report_fatal_error("dspic: variadic arguments have no measured convention "
                       "(L1c; cc1 was not asked)",
                       /*gen_crash_diag=*/false);

  SmallVector<unsigned, 8> ArgsParts;
  ParseFunctionArgs(Args, ArgsParts);

  // Pass 1: registers by the lowest-free-run rule; what finds none is a stack argument.
  struct Plan {
    unsigned FirstVal, Parts;
    int Reg;           // index into ArgRegs16, or -1 for the stack
    unsigned StackOff; // real offset in the outgoing area, when Reg < 0
  };
  SmallVector<Plan, 8> Plans;
  unsigned Used = 0, ValNo = 0;
  for (unsigned Parts : ArgsParts) {
    if (Args[ValNo].Flags.isByVal())
      report_fatal_error("dspic: a byval argument has no lowering (L1c; cc1 "
                         "passes a struct by value word by word in registers)",
                         /*gen_crash_diag=*/false);
    if (Parts != 1 && Parts != 2 && Parts != 4)
      report_fatal_error("dspic: an argument of " + Twine(Parts) +
                         " words has no measured convention",
                         /*gen_crash_diag=*/false);
    int Run = lowestFreeRun(Used, Parts);
    if (Run >= 0)
      Used |= ((1u << Parts) - 1) << Run;
    Plans.push_back({ValNo, Parts, Run, 0});
    ValNo += Parts;
  }

  // Pass 2: the stack, from the LAST stack argument (real offset 0) to the first (at the
  // top, just below the return address).
  for (Plan &P : llvm::reverse(Plans))
    if (P.Reg < 0)
      P.StackOff = State.AllocateStack(2 * P.Parts, Align(2));

  // The locations, in argument order; a multi-part argument little-endian.
  for (const Plan &P : Plans) {
    for (unsigned J = 0; J < P.Parts; ++J) {
      unsigned V = P.FirstVal + J;
      MVT VT = Args[V].VT;
      if (VT != MVT::i8 && VT != MVT::i16)
        report_fatal_error("dspic: an argument part of " +
                           Twine(VT.getSizeInBits()) + " bits",
                           /*gen_crash_diag=*/false);
      if (P.Reg >= 0) {
        MCPhysReg Reg =
            VT == MVT::i8 ? ArgRegs8[P.Reg + J] : ArgRegs16[P.Reg + J];
        MCRegister Got = State.AllocateReg(Reg);
        assert(Got.id() == Reg && "the lowest-free-run rule reused a register");
        (void)Got;
        State.addLoc(CCValAssign::getReg(V, VT, Reg, VT, CCValAssign::Full));
      } else {
        State.addLoc(CCValAssign::getMem(V, VT, P.StackOff + 2 * J, VT,
                                         CCValAssign::Full));
      }
    }
  }
}

static void AnalyzeRetResult(CCState &State,
                             const SmallVectorImpl<ISD::InputArg> &Ins) {
  State.AnalyzeCallResult(Ins, RetCC_DSPIC);
}

static void AnalyzeRetResult(CCState &State,
                             const SmallVectorImpl<ISD::OutputArg> &Outs) {
  State.AnalyzeReturn(Outs, RetCC_DSPIC);
}

template<typename ArgT>
static void AnalyzeReturnValues(CCState &State,
                                SmallVectorImpl<CCValAssign> &RVLocs,
                                const SmallVectorImpl<ArgT> &Args) {
  AnalyzeRetResult(State, Args);
}

SDValue DSPICTargetLowering::LowerFormalArguments(
    SDValue Chain, CallingConv::ID CallConv, bool isVarArg,
    const SmallVectorImpl<ISD::InputArg> &Ins, const SDLoc &dl,
    SelectionDAG &DAG, SmallVectorImpl<SDValue> &InVals) const {

  switch (CallConv) {
  default:
    report_fatal_error("Unsupported calling convention");
  case CallingConv::C:
  case CallingConv::Fast:
  case CallingConv::Tail:
    return LowerCCCArguments(Chain, CallConv, isVarArg, Ins, dl, DAG, InVals);
  case CallingConv::MSP430_INTR:
    if (Ins.empty())
      return Chain;
    report_fatal_error("ISRs cannot have arguments");
  }
}

// Clauses 2-5 of the compatible-frame rule (clause 1, tail position, is the DAG builder's).
bool DSPICTargetLowering::isEligibleForTailCall(
    const TargetLowering::CallLoweringInfo &CLI, std::string &Why) const {
  MachineFunction &MF = CLI.DAG.getMachineFunction();
  const Function &Caller = MF.getFunction();
  const auto *FuncInfo = MF.getInfo<DSPICMachineFunctionInfo>();

  auto IsC = [](CallingConv::ID CC) {
    return CC == CallingConv::C || CC == CallingConv::Fast ||
           CC == CallingConv::Tail;
  };
  if (!IsC(CLI.CallConv) || !IsC(Caller.getCallingConv())) {
    Why = "the caller or the callee is not under the C convention";
    return false;
  }
  if (CLI.IsVarArg || Caller.isVarArg()) {
    Why = "the caller or the callee is variadic";
    return false;
  }
  for (const ISD::OutputArg &A : CLI.Outs)
    if (A.Flags.isByVal()) {
      Why = "an argument is passed byval";
      return false;
    }

  SmallVector<CCValAssign, 16> ArgLocs;
  CCState CCInfo(CLI.CallConv, CLI.IsVarArg, MF, ArgLocs,
                 *CLI.DAG.getContext());
  AnalyzeArguments(CCInfo, ArgLocs, CLI.Outs);
  unsigned Need = CCInfo.getStackSize();
  unsigned Have = FuncInfo->getIncomingArgBytes();
  if (Need > Have) {
    Why = ("the callee needs " + Twine(Need) +
           " bytes of stack arguments and the caller receives " + Twine(Have))
              .str();
    return false;
  }

  bool Direct = isa<GlobalAddressSDNode>(CLI.Callee) ||
                isa<ExternalSymbolSDNode>(CLI.Callee);
  if (!Direct) {
    unsigned RegWords = 0;
    for (const CCValAssign &VA : ArgLocs)
      if (VA.isRegLoc())
        ++RegWords;
    if (RegWords >= 8) {
      Why = "an indirect target with all eight argument registers in use has "
            "no caller-saved register to live in across the epilogue";
      return false;
    }
  }
  return true;
}

static std::string calleeName(SDValue Callee) {
  if (auto *G = dyn_cast<GlobalAddressSDNode>(Callee))
    return ("_" + G->getGlobal()->getName()).str();
  if (auto *E = dyn_cast<ExternalSymbolSDNode>(Callee))
    return ("_" + StringRef(E->getSymbol())).str();
  return "an indirect callee";
}

SDValue
DSPICTargetLowering::LowerCall(TargetLowering::CallLoweringInfo &CLI,
                                SmallVectorImpl<SDValue> &InVals) const {
  SelectionDAG &DAG                     = CLI.DAG;
  SDLoc &dl                             = CLI.DL;
  SmallVectorImpl<ISD::OutputArg> &Outs = CLI.Outs;
  SmallVectorImpl<SDValue> &OutVals     = CLI.OutVals;
  SmallVectorImpl<ISD::InputArg> &Ins   = CLI.Ins;
  SDValue Chain                         = CLI.Chain;
  SDValue Callee                        = CLI.Callee;
  bool &isTailCall                      = CLI.IsTailCall;
  CallingConv::ID CallConv              = CLI.CallConv;
  bool isVarArg                         = CLI.IsVarArg;
  bool IsMustTail = CLI.CB && CLI.CB->isMustTailCall();

  switch (CallConv) {
  default:
    report_fatal_error("Unsupported calling convention");
  case CallingConv::MSP430_INTR:
    report_fatal_error("ISRs cannot be called directly");
  case CallingConv::Fast:
  case CallingConv::Tail:
  case CallingConv::C:
    break;
  }

  // The compatible-frame rule: a musttail it refuses is an error; a `tail` a plain call.
  std::string Name = calleeName(Callee);
  if (IsMustTail && !isTailCall)
    report_fatal_error("dspic: musttail call to " + Twine(Name) +
                       " cannot be honoured: the DAG builder took it out of "
                       "tail position (a demoted struct return)",
                       /*gen_crash_diag=*/false);
  if (isTailCall) {
    std::string Why;
    if (!isEligibleForTailCall(CLI, Why)) {
      if (IsMustTail)
        report_fatal_error("dspic: musttail call to " + Twine(Name) +
                           " cannot be honoured: " + Twine(Why),
                           /*gen_crash_diag=*/false);
      isTailCall = false;
    }
  }

  return LowerCCCCallTo(Chain, Callee, CallConv, isVarArg, isTailCall,
                        Outs, OutVals, Ins, dl, DAG, InVals);
}

