robbym/llvm-project/llvm/lib/Target/DSPIC/DSPICISelLowering.cpp
  if (!isTailCall)
    Chain = DAG.getCALLSEQ_START(Chain, NumBytes, 0, dl);
  // L1f-a: a plain call PUSHES its stack arguments, the last stack argument first (real
  // offset 0 is the bottom), and pops them with `sub.w #N,w15` after the call; the
  // pushes are chained in order. A tail call still writes its caller's incoming slots.
  SmallVector<std::pair<int64_t, SDValue>, 8> Pushes;
  // A tail call writes over this function's incoming slots: every load from them first.
  SDValue StoreChain = (isTailCall && NumBytes)
                           ? DAG.getStackArgumentTokenFactor(Chain)
                           : Chain;

  SmallVector<std::pair<unsigned, SDValue>, 8> RegsToPass;
  SmallVector<SDValue, 12> MemOpChains;
  SDValue StackPtr;

  for (unsigned i = 0, e = ArgLocs.size(); i != e; ++i) {
    CCValAssign &VA = ArgLocs[i];
    SDValue Arg = OutVals[i];
    assert(VA.getLocInfo() == CCValAssign::Full && "nothing is promoted here");
    if (VA.isRegLoc()) {
      RegsToPass.push_back(std::make_pair(VA.getLocReg(), Arg));
      continue;
    }
    assert(VA.isMemLoc());
    assert(!Outs[i].Flags.isByVal() && "refused by AnalyzeArguments");
    int64_t Real = VA.getLocMemOffset();
    SDValue MemOp;
    if (isTailCall) {
      int FI = MFI.CreateFixedObject(VA.getLocVT().getStoreSize(),
                                     Real - (int64_t)NumBytes - 4,
                                     /*IsImmutable=*/false);
      MemOp = DAG.getStore(StoreChain, dl, Arg, DAG.getFrameIndex(FI, PtrVT),
                           MachinePointerInfo::getFixedStack(MF, FI));
    } else {
      SDValue Word = Arg;
      if (Word.getValueType() == MVT::i8) // a byte rides in the low half of a word
        Word = DAG.getNode(ISD::ANY_EXTEND, dl, MVT::i16, Word);
      Pushes.push_back({Real, Word});
      continue;
    }
    MemOpChains.push_back(MemOp);
  }
  (void)StackPtr;
  llvm::sort(Pushes, [](const auto &A, const auto &B) { return A.first < B.first; });
  for (const auto &[Off, Word] : Pushes)
    Chain = DAG.getNode(DSPICISD::PUSH, dl, MVT::Other, Chain, Word);

  if (!MemOpChains.empty())
    Chain = DAG.getNode(ISD::TokenFactor, dl, MVT::Other, MemOpChains);

  SDValue InGlue;
  for (const auto &[Reg, N] : RegsToPass) {
    Chain = DAG.getCopyToReg(Chain, dl, Reg, N, InGlue);
    InGlue = Chain.getValue(1);
  }

  if (GlobalAddressSDNode *G = dyn_cast<GlobalAddressSDNode>(Callee))
    Callee = DAG.getTargetGlobalAddress(G->getGlobal(), dl, MVT::i16);
  else if (ExternalSymbolSDNode *E = dyn_cast<ExternalSymbolSDNode>(Callee))
    Callee = DAG.getTargetExternalSymbol(E->getSymbol(), MVT::i16);

  SmallVector<SDValue, 8> Ops;
  Ops.push_back(Chain);
  Ops.push_back(Callee);
  for (const auto &[Reg, N] : RegsToPass)
    Ops.push_back(DAG.getRegister(Reg, N.getValueType()));
  if (InGlue.getNode())
    Ops.push_back(InGlue);

  if (isTailCall) {
    // Nothing returns here: the callee returns to this function's caller.
    MFI.setHasTailCall();
    return DAG.getNode(DSPICISD::TC_RETURN, dl, MVT::Other, Ops);
  }

  SDVTList NodeTys = DAG.getVTList(MVT::Other, MVT::Glue);
  // rcall (one word, PC-relative) by default, as cc1's small-code model; `call` under
  // +large-code. An indirect call is `call wN` either way.
  bool Direct = isa<GlobalAddressSDNode>(Callee) || isa<ExternalSymbolSDNode>(Callee);
  bool Large = MF.getSubtarget<DSPICSubtarget>().isLargeCode();
  Chain = DAG.getNode(Direct && !Large ? DSPICISD::RCALL : DSPICISD::CALL, dl, NodeTys, Ops);
  InGlue = Chain.getValue(1);
  Chain = DAG.getCALLSEQ_END(Chain, NumBytes, 0, InGlue, dl);
  InGlue = Chain.getValue(1);
  return LowerCallResult(Chain, InGlue, CallConv, isVarArg, Ins, dl, DAG,
                         InVals);
}

/// LowerCallResult - Lower the result values of a call into the
/// appropriate copies out of appropriate physical registers.
///
SDValue DSPICTargetLowering::LowerCallResult(
    SDValue Chain, SDValue InGlue, CallingConv::ID CallConv, bool isVarArg,
    const SmallVectorImpl<ISD::InputArg> &Ins, const SDLoc &dl,
    SelectionDAG &DAG, SmallVectorImpl<SDValue> &InVals) const {

  // Assign locations to each value returned by this call.
  SmallVector<CCValAssign, 16> RVLocs;
  CCState CCInfo(CallConv, isVarArg, DAG.getMachineFunction(), RVLocs,
                 *DAG.getContext());

  AnalyzeReturnValues(CCInfo, RVLocs, Ins);

  // Copy all of the result registers out of their specified physreg.
  for (unsigned i = 0; i != RVLocs.size(); ++i) {
    Chain = DAG.getCopyFromReg(Chain, dl, RVLocs[i].getLocReg(),
                               RVLocs[i].getValVT(), InGlue).getValue(1);
    InGlue = Chain.getValue(2);
    InVals.push_back(Chain.getValue(0));
  }

  return Chain;
}

// L1f-d increment 4: UDIVREM/SDIVREM -> the target 2-result node (selected to the divide
// pseudo). A lone div or rem reached here through the combiner's DIVREM formation.
SDValue DSPICTargetLowering::LowerDivRem(SDValue Op, SelectionDAG &DAG) const {
  SDLoc dl(Op);
  unsigned N = Op.getOpcode() == ISD::SDIVREM ? DSPICISD::SDIVREM : DSPICISD::UDIVREM;
  SDVTList VTs = DAG.getVTList(MVT::i16, MVT::i16);
  SDValue R = DAG.getNode(N, dl, VTs, Op.getOperand(0), Op.getOperand(1));
  return R;
}



// L1f-f (trellis session 87): an i32 shift by ONE arrives from the type legalizer already
// expanded (SHL_PARTS is never asked for a constant amount):
//   x >> 1: hi' = srl hi,1 ; lo' = (srl lo,1) | (shl hi,15)      (sra for a signed x)
//   x << 1: lo' = shl lo,1 ; hi' = (shl hi,1) | (srl lo,15)
// The `or` is the signature. It becomes one result of the carry pair's pseudo (lsr/asr hi ;
// rrc lo -- add lo,lo ; addc hi,hi) and the other half's shift, found among that half's uses,
// takes the other result. Two words for the expansion's four; cc1's own shapes.

// L1f-h bfins (trellis session 88): recognize a bit-field insert `or` and form DSPICbfins. A
// wrong bfins silently corrupts (session 87's lesson), so the validation is exhaustive and the
// node is produced ONLY for an `or` that is exactly (BASE & ~field) | ((V<<k) & field).
static SDValue combineBitfieldInsert(SDNode *N, SelectionDAG &DAG) {
  if (N->getValueType(0) != MVT::i16)
    return SDValue();
  auto tryKeep = [&](SDValue A, SDValue B) -> SDValue {
    if (A.getOpcode() != ISD::AND)
      return SDValue();
    auto *KC = dyn_cast<ConstantSDNode>(A.getOperand(1));
    if (!KC)
      return SDValue();
    uint16_t keep = (uint16_t)KC->getZExtValue();
    uint16_t field = (uint16_t)~keep;
    if (field == 0 || !isShiftedMask_32(field))
      return SDValue();
    unsigned k = llvm::countr_zero((uint32_t)field);
    unsigned n = llvm::popcount((uint32_t)field);
    if (n < 1 || n >= 16)
      return SDValue();
    SDValue BASE = A.getOperand(0);
    SDValue V;
    if (B.getOpcode() == ISD::AND) {
      auto *FC = dyn_cast<ConstantSDNode>(B.getOperand(1));
      if (!FC || (uint16_t)FC->getZExtValue() != field)
        return SDValue();
      SDValue inner = B.getOperand(0);
      if (k == 0) {
        V = inner;
      } else {
        if (inner.getOpcode() != ISD::SHL)
          return SDValue();
        auto *SC = dyn_cast<ConstantSDNode>(inner.getOperand(1));
        if (!SC || SC->getZExtValue() != k)
          return SDValue();
        V = inner.getOperand(0);
      }
    } else if (B.getOpcode() == ISD::SHL) {
      // an unmasked shift is a bit-field insert only when the field reaches bit 15
      if (k + n != 16)
        return SDValue();
      auto *SC = dyn_cast<ConstantSDNode>(B.getOperand(1));
      if (!SC || SC->getZExtValue() != k)
        return SDValue();
      V = B.getOperand(0);
    } else {
      return SDValue();
    }
    SDLoc dl(N);
    return DAG.getNode(DSPICISD::BFINS, dl, MVT::i16, BASE, V,
                       DAG.getTargetConstant(k, dl, MVT::i16),
                       DAG.getTargetConstant(n, dl, MVT::i16));
  };
  if (SDValue R = tryKeep(N->getOperand(0), N->getOperand(1)))
    return R;
  return tryKeep(N->getOperand(1), N->getOperand(0));
}

static SDValue combineOrIntoShift32(SDNode *N, TargetLowering::DAGCombinerInfo &DCI) {
  SelectionDAG &DAG = DCI.DAG;
  if (N->getValueType(0) != MVT::i16)
    return SDValue();
  auto shiftBy = [](SDValue V, unsigned Opc, unsigned K) -> SDValue {
    if (V.getOpcode() != Opc || !V.hasOneUse())
      return SDValue();
    auto *C = dyn_cast<ConstantSDNode>(V.getOperand(1));
    return (C && C->getZExtValue() == K) ? V.getOperand(0) : SDValue();
  };
  auto shiftUser = [](SDValue V, unsigned K, bool Left) -> SDNode * {
    for (SDNode *U : V.getNode()->users()) {
      bool Ok = Left ? U->getOpcode() == ISD::SHL
                     : (U->getOpcode() == ISD::SRL || U->getOpcode() == ISD::SRA);
      if (!Ok || U->getValueType(0) != MVT::i16 || U->getOperand(0) != V)
        continue;
      auto *C = dyn_cast<ConstantSDNode>(U->getOperand(1));
      if (C && C->getZExtValue() == K)
        return U;
    }
    return nullptr;
  };
  SDLoc dl(N);
  SDVTList VTs = DAG.getVTList(MVT::i16, MVT::i16);
  for (int Swap = 0; Swap < 2; ++Swap) {
    SDValue X = N->getOperand(Swap), Y = N->getOperand(1 - Swap);
    // right by one
    if (SDValue Lo = shiftBy(X, ISD::SRL, 1)) {
      if (SDValue Hi = shiftBy(Y, ISD::SHL, 15)) {
        if (SDNode *U = shiftUser(Hi, 1, false)) {
          unsigned Opc = U->getOpcode() == ISD::SRA ? DSPICISD::SRA32_1 : DSPICISD::SRL32_1;
          SDValue R = DAG.getNode(Opc, dl, VTs, Lo, Hi);
          DCI.CombineTo(U, R.getValue(1));
          return R.getValue(0);
        }
      }
    }
    // left by one
    if (SDValue Hi = shiftBy(X, ISD::SHL, 1)) {
      if (SDValue Lo = shiftBy(Y, ISD::SRL, 15)) {
        if (SDNode *U = shiftUser(Lo, 1, true)) {
          SDValue R = DAG.getNode(DSPICISD::SHL32_1, dl, VTs, Lo, Hi);
          DCI.CombineTo(U, R.getValue(0));
          return R.getValue(1);
        }
      }
    }
  }
  return SDValue();
}

// combineProgLoad handles i16 and i32 (session 89): fold an addrspace(1) read into PSV-window
// word reads. Each word is an independent PSVLD (offset in i16, page in i16); the i32 read does
// two, at the address and address+2 (the +2 in i32 so it carries into the page).
static SDValue psvWord(SelectionDAG &DAG, const SDLoc &dl, SDValue Chain, SDValue Addr32,
                       MachineMemOperand *MMO) {
  SDValue Off  = DAG.getNode(ISD::TRUNCATE, dl, MVT::i16, Addr32);
  SDValue Hi   = DAG.getNode(ISD::SRL, dl, MVT::i32, Addr32, DAG.getConstant(16, dl, MVT::i32));
  SDValue Page = DAG.getNode(ISD::TRUNCATE, dl, MVT::i16, Hi);
  SDValue Ops[] = { Chain, Off, Page };
  return DAG.getMemIntrinsicNode(DSPICISD::PSVLD, dl,
             DAG.getVTList(MVT::i16, MVT::Other), Ops, MVT::i16, MMO);
}

// Session 90: the byte read (PSVLD8 raw, PSVLD8Z zero-extended, PSVLD8S sign-extended -- the
// extension is in the windowed instruction because `mov.b [w],w` does not zero the high byte).
static SDValue psvByte(SelectionDAG &DAG, const SDLoc &dl, SDValue Chain, SDValue Addr32,
                       MachineMemOperand *MMO, unsigned Node, EVT ResVT) {
  SDValue Off  = DAG.getNode(ISD::TRUNCATE, dl, MVT::i16, Addr32);
  SDValue Hi   = DAG.getNode(ISD::SRL, dl, MVT::i32, Addr32, DAG.getConstant(16, dl, MVT::i32));
  SDValue Page = DAG.getNode(ISD::TRUNCATE, dl, MVT::i16, Hi);
  SDValue Ops[] = { Chain, Off, Page };
  return DAG.getMemIntrinsicNode(Node, dl, DAG.getVTList(ResVT, MVT::Other), Ops, MVT::i8, MMO);
}

