robbym/llvm-project/llvm/lib/Target/DSPIC/DSPICISelLowering.cpp
static SDValue combineProgLoad(SDNode *N, TargetLowering::DAGCombinerInfo &DCI) {
  LoadSDNode *LD = cast<LoadSDNode>(N);
  if (LD->getAddressSpace() != 1)
    return SDValue();
  EVT VT = LD->getMemoryVT();
  ISD::LoadExtType Ext = LD->getExtensionType();
  SelectionDAG &DAG = DCI.DAG;
  SDLoc dl(N);
  SDValue Ptr = LD->getBasePtr();  // i32 program address: page:offset

  // Session 90: a BYTE read. `mov.b [w],w` does NOT zero the high byte on dsPIC, so an
  // extending load must extend IN the windowed read (`ze`/`se`), never via a following op the
  // def8 -> SUBREG_TO_REG rewrite would drop. NON_EXTLOAD (a `char` used as a byte) keeps the
  // raw `mov.b`; the consumer truncates.
  if (VT == MVT::i8) {
    unsigned Node = Ext == ISD::ZEXTLOAD ? DSPICISD::PSVLD8Z
                  : Ext == ISD::SEXTLOAD ? DSPICISD::PSVLD8S : DSPICISD::PSVLD8;
    EVT ResVT = Ext == ISD::NON_EXTLOAD ? MVT::i8 : MVT::i16;
    SDValue B = psvByte(DAG, dl, LD->getChain(), Ptr, LD->getMemOperand(), Node, ResVT);
    SDValue Val = B;
    if (Ext != ISD::NON_EXTLOAD && LD->getValueType(0) != MVT::i16)
      Val = DAG.getNode(ISD::ANY_EXTEND, dl, LD->getValueType(0), B);
    DCI.CombineTo(N, Val, B.getValue(1));
    return SDValue(N, 0);
  }
  if (Ext != ISD::NON_EXTLOAD)
    return SDValue();

  if (VT == MVT::i16) {
    SDValue W = psvWord(DAG, dl, LD->getChain(), Ptr, LD->getMemOperand());
    DCI.CombineTo(N, W, W.getValue(1));
    return SDValue(N, 0);
  }
  if (VT == MVT::i32) {
    SDValue Lo = psvWord(DAG, dl, LD->getChain(), Ptr, LD->getMemOperand());
    SDValue Ptr2 = DAG.getNode(ISD::ADD, dl, MVT::i32, Ptr, DAG.getConstant(2, dl, MVT::i32));
    SDValue Hi = psvWord(DAG, dl, Lo.getValue(1), Ptr2, LD->getMemOperand());
    SDValue Val = DAG.getNode(ISD::BUILD_PAIR, dl, MVT::i32, Lo, Hi);
    DCI.CombineTo(N, Val, Hi.getValue(1));
    return SDValue(N, 0);
  }
  // Wider scalars (i64, float) never reach here from the firmware corpus; an aggregate read is
  // a memcpy and goes to EmitTargetCodeForMemcpy (session 90: the `__memcpy_helper` libcall).
  return SDValue();
}

// Session 90: a block copy touching PROGRAM memory (addrspace 1) is never expanded into loads
// and stores -- those would be data reads of a program address, which the pre-session-90
// backend crashed on ("Do not know how to expand this operator's operand"). Declining sends
// it to EmitTargetCodeForMemcpy, which emits cc1's `__memcpy_helper` libcall.
bool DSPICTargetLowering::findOptimalMemOpLowering(
    LLVMContext &Context, std::vector<EVT> &MemOps, unsigned Limit, const MemOp &Op,
    unsigned DstAS, unsigned SrcAS, const AttributeList &FuncAttributes, EVT *LargestVT) const {
  if (SrcAS == 1 || DstAS == 1)
    return false;
  return TargetLowering::findOptimalMemOpLowering(Context, MemOps, Limit, Op, DstAS, SrcAS,
                                                  FuncAttributes, LargestVT);
}

// Session 90: an inline-asm "i"/"s" operand naming a PROGRAM-memory global (addrspace 1, an
// i32 address) stays SYMBOLIC -- an i16 target address the printer renders as the bare symbol
// (`%c1`), so `mov #tblpage(%c1),%0` reaches the assembler with the symbol and the LINKER
// computes the page/offset (binutils include/elf/pic30.h). The default would hand the type
// legalizer an i32 TargetGlobalAddress it cannot expand (session 89's crash, the reason the
// shim was pure casts). Constant offsets fold as in the default ((GA+C), (GA-C), ...).
void DSPICTargetLowering::LowerAsmOperandForConstraint(SDValue Op, StringRef Constraint,
                                                        std::vector<SDValue> &Ops,
                                                        SelectionDAG &DAG) const {
  if (Constraint.size() == 1 && (Constraint[0] == 'i' || Constraint[0] == 's' ||
                                 Constraint[0] == 'X') && Op.getValueType() == MVT::i32) {
    int64_t Offset = 0;
    SDValue V = Op;
    while (true) {
      if (auto *GA = dyn_cast<GlobalAddressSDNode>(V)) {
        Ops.push_back(DAG.getTargetGlobalAddress(GA->getGlobal(), SDLoc(Op), MVT::i16,
                                                 Offset + GA->getOffset()));
        return;
      }
      unsigned Opc = V.getOpcode();
      if (Opc != ISD::ADD && Opc != ISD::SUB)
        break;
      ConstantSDNode *C;
      if ((C = dyn_cast<ConstantSDNode>(V.getOperand(0))))
        V = V.getOperand(1);
      else if (Opc == ISD::ADD && (C = dyn_cast<ConstantSDNode>(V.getOperand(1))))
        V = V.getOperand(0);
      else
        break;
      Offset += (Opc == ISD::ADD ? 1 : -1) * C->getSExtValue();
    }
  }
  TargetLowering::LowerAsmOperandForConstraint(Op, Constraint, Ops, DAG);
}

// L1f-k (trellis session 92): the generic fold BRCOND(SETCC) -> BR_CC (DAGCombiner::visitBRCOND)
// tests isOperationLegalOrCustom on the COMPARAND type, which requires the type to be legal -- so
// on i32 it never fires, the SETCC is lowered alone to a boolean during type legalization, and the
// branch tests that boolean. (SELECT(SETCC) -> SELECT_CC in visitSELECT is gated on the select's
// RESULT type instead: an i16 select over an i32 compare already folds generically, and the SELECT
// half below serves an i32-RESULT select only -- the refuter's correction, session 92.)
// Historically the next lines read: the SETCC is lowered alone to a
// boolean during type legalization, and the branch tests that boolean (`btst #0 ; bra nz`, three
// words past the compare). Done by hand here, BEFORE type legalization, for a SETCC on i32 (and its
// `xor #1` inverted spelling); the fused compare then reaches LowerBR_CC / LowerSELECT_CC through
// the Custom operand path. An i32-result SELECT_CC is split by the legalizer into two i16 ones.
static SDValue combineCond32(SDNode *N, TargetLowering::DAGCombinerInfo &DCI) {
  SelectionDAG &DAG = DCI.DAG;
  if (!DCI.isBeforeLegalize())
    return SDValue();
  bool IsBr = N->getOpcode() == ISD::BRCOND;
  SDValue Cond = N->getOperand(IsBr ? 1 : 0);
  bool Invert = false;
  if (Cond.getOpcode() == ISD::XOR && isOneConstant(Cond.getOperand(1)) &&
      Cond.getOperand(0).getOpcode() == ISD::SETCC && Cond.hasOneUse()) {
    Invert = true;
    Cond = Cond.getOperand(0);
  }
  if (Cond.getOpcode() != ISD::SETCC || Cond.getOperand(0).getValueType() != MVT::i32)
    return SDValue();
  ISD::CondCode CC = cast<CondCodeSDNode>(Cond.getOperand(2))->get();
  if (Invert)
    CC = ISD::getSetCCInverse(CC, MVT::i32);
  SDLoc dl(N);
  if (IsBr)
    return DAG.getNode(ISD::BR_CC, dl, MVT::Other, N->getOperand(0), DAG.getCondCode(CC),
                       Cond.getOperand(0), Cond.getOperand(1), N->getOperand(2));
  return DAG.getNode(ISD::SELECT_CC, dl, N->getValueType(0), Cond.getOperand(0),
                     Cond.getOperand(1), N->getOperand(1), N->getOperand(2), DAG.getCondCode(CC));
}


// L1f-k (trellis session 92): what the combiner may assume of the target nodes a compare lowers
// to. The i32 path lowers DURING type legalization, so the `and #1` that the i1 promotion leaves
// on a boolean meets FLAG2BOOL / SELECT_CC rather than the SETCC the combiner knows is 0/1; these
// let it fold as it does on i16.
void DSPICTargetLowering::computeKnownBitsForTargetNode(const SDValue Op, KnownBits &Known,
                                                        const APInt &DemandedElts,
                                                        const SelectionDAG &DAG,
                                                        unsigned Depth) const {
  Known.resetAll();
  switch (Op.getOpcode()) {
  case DSPICISD::FLAG2BOOL:
    // `clr ; bsw ; [btg #0]`: a 0/1 word
    Known.Zero.setBitsFrom(1);
    break;
  case DSPICISD::SELECT_CC: {
    KnownBits KT = DAG.computeKnownBits(Op.getOperand(0), Depth + 1);
    KnownBits KF = DAG.computeKnownBits(Op.getOperand(1), Depth + 1);
    Known = KT.intersectWith(KF);
    break;
  }
  default:
    break;
  }
}

// (session 92, the libcalls row) InstCombine spells `a * b` on two i64 arguments `mul %b, %a`,
// and the routine then took its eight argument words through w8..w11 (14 words) where cc1 is one
// `bra ___muldi3`. For a commutative op the backend hands to a routine (MUL wider than the word,
// FADD, FMUL), put the operand that is the EARLIER formal argument first: the lowest CopyFromReg
// vreg under each operand's BUILD_PAIR tree, in the order the arguments were lowered.
static unsigned firstArgVReg(SDValue V) {
  while (V.getOpcode() == ISD::BUILD_PAIR)
    V = V.getOperand(0);
  if (V.getOpcode() != ISD::CopyFromReg)
    return 0;
  Register R = cast<RegisterSDNode>(V.getOperand(1))->getReg();
  return R.isVirtual() ? R.virtRegIndex() + 1 : 0;
}
static SDValue combineCommutativeLibcallOrder(SDNode *N, TargetLowering::DAGCombinerInfo &DCI) {
  if (!DCI.isBeforeLegalize())
    return SDValue();
  EVT VT = N->getValueType(0);
  bool Routine = N->getOpcode() == ISD::MUL ? VT.getSizeInBits() > 16 : VT.isFloatingPoint();
  if (!Routine)
    return SDValue();
  unsigned L = firstArgVReg(N->getOperand(0)), R = firstArgVReg(N->getOperand(1));
  if (!L || !R || L <= R)
    return SDValue();
  return DCI.DAG.getNode(N->getOpcode(), SDLoc(N), VT, N->getOperand(1), N->getOperand(0),
                         N->getFlags());
}

SDValue DSPICTargetLowering::PerformDAGCombine(SDNode *N, DAGCombinerInfo &DCI) const {
  if (N->getOpcode() == ISD::MUL || N->getOpcode() == ISD::FADD || N->getOpcode() == ISD::FMUL)
    return combineCommutativeLibcallOrder(N, DCI);
  if (N->getOpcode() == ISD::BRCOND || N->getOpcode() == ISD::SELECT)
    return combineCond32(N, DCI);
  if (N->getOpcode() == ISD::LOAD)
    return combineProgLoad(N, DCI);
  if (N->getOpcode() == ISD::OR) {
    if (SDValue R = combineBitfieldInsert(N, DCI.DAG))
      return R;
    return combineOrIntoShift32(N, DCI);
  }
  return SDValue();
}

SDValue DSPICTargetLowering::LowerShifts(SDValue Op,
                                          SelectionDAG &DAG) const {
  // L1f-c (trellis session 86). A shift is one word for any amount in a register or in
  // 1..15 (`sl Wb,#lit4,Wd`, `sl Wb,Wns,Wnd`, `sl Ws,Wd`; a byte through the word forms by
  // pattern); an amount >= the width is folded (zero, or the sign for sra). A rotate by
  // one is legal and any other rotate returns nothing, falling through to Expand.
  unsigned Opc = Op.getOpcode();
  SDNode *N = Op.getNode();
  EVT VT = Op.getValueType();
  SDLoc dl(N);
  SDValue Val = N->getOperand(0);
  SDValue Amt = N->getOperand(1);
  auto *CAmt = dyn_cast<ConstantSDNode>(Amt);

  // L1f-f: a rotate by width-1 is the rotate by one the other way (the combiner spells a
  // rotate right by one as `rotl x, 15`; L1f-c's ror1 was three words for that reason)
  if (Opc == ISD::ROTL || Opc == ISD::ROTR) {
    if (!CAmt)
      return SDValue();
    uint64_t K = CAmt->getZExtValue();
    if (K == 1)
      return Op;
    if (K == VT.getSizeInBits() - 1)
      return DAG.getNode(Opc == ISD::ROTL ? ISD::ROTR : ISD::ROTL, dl, VT, Val,
                         DAG.getConstant(1, dl, MVT::i16));
    return SDValue();
  }

  if (CAmt) {
    uint64_t K = CAmt->getZExtValue();
    unsigned Bits = VT.getSizeInBits();
    if (K == 0)
      return Val;
    if (K >= Bits)
      return Opc == ISD::SRA
                 ? DAG.getNode(ISD::SRA, dl, VT, Val,
                               DAG.getConstant(Bits - 1, dl, MVT::i16))
                 : DAG.getConstant(0, dl, VT);
    return DAG.getNode(Opc, dl, VT, Val, DAG.getConstant(K, dl, MVT::i16));
  }
  return Op;
}

SDValue DSPICTargetLowering::LowerGlobalAddress(SDValue Op,
                                                 SelectionDAG &DAG) const {
  const GlobalValue *GV = cast<GlobalAddressSDNode>(Op)->getGlobal();
  int64_t Offset = cast<GlobalAddressSDNode>(Op)->getOffset();
  EVT PtrVT = Op.getValueType();

  // L1e prog-space (session 89): a program-memory global (addrspace 1) has a 24-bit address held
  // page:offset in 4 bytes -- `mov #tbloffset(sym),wLo ; mov #tblpage(sym),wHi`, cc1's shape.
  if (GV->getAddressSpace() == 1) {
    SDLoc dl(Op);
    SDValue Lo = DAG.getTargetGlobalAddress(GV, dl, MVT::i16, Offset, DSPICII::MO_TBLOFFSET);
    SDValue Hi = DAG.getTargetGlobalAddress(GV, dl, MVT::i16, Offset, DSPICII::MO_TBLPAGE);
    Lo = DAG.getNode(DSPICISD::Wrapper, dl, MVT::i16, Lo);
    Hi = DAG.getNode(DSPICISD::Wrapper, dl, MVT::i16, Hi);
    return DAG.getNode(ISD::BUILD_PAIR, dl, MVT::i32, Lo, Hi);
  }

