robbym/llvm-project/llvm/lib/Target/DSPIC/DSPICISelLowering.cpp
  // Create the TargetGlobalAddress node, folding in the constant offset.
  SDValue Result = DAG.getTargetGlobalAddress(GV, SDLoc(Op), PtrVT, Offset);
  return DAG.getNode(DSPICISD::Wrapper, SDLoc(Op), PtrVT, Result);
}

void DSPICTargetLowering::ReplaceNodeResults(SDNode *N,
                                             SmallVectorImpl<SDValue> &Results,
                                             SelectionDAG &DAG) const {
  // L1e prog-space (session 89): the address of a program-memory (addrspace 1) global is an
  // illegal i32 held page:offset. LowerGlobalAddress builds it as tbloffset:tblpage; hand the
  // i32 back so the integer legalizer expands the BUILD_PAIR into the two i16 halves.
  switch (N->getOpcode()) {
  case ISD::GlobalAddress:
    Results.push_back(LowerGlobalAddress(SDValue(N, 0), DAG));
    break;
  case ISD::SELECT_CC:
    // L1f-k: an i32 RESULT -- decline, and the legalizer splits it into two i16 selects whose
    // i32 comparands then reach LowerSELECT_CC through the operand path.
    break;
  case ISD::UMIN:
  case ISD::UMAX:
  case ISD::SMIN:
  case ISD::SMAX: {
    // L1f-k: `a < b ? a : b` again, as the SELECT_CC the case above splits into fused halves
    // (ExpandIntRes_MINMAX would build a SETCC on the pair and select on its boolean instead).
    unsigned Opc = N->getOpcode();
    ISD::CondCode CC = Opc == ISD::UMIN ? ISD::SETULT : Opc == ISD::UMAX ? ISD::SETUGT
                     : Opc == ISD::SMIN ? ISD::SETLT : ISD::SETGT;
    SDValue A = N->getOperand(0), B = N->getOperand(1);
    Results.push_back(DAG.getSelectCC(SDLoc(N), A, B, A, B, CC));
    break;
  }
  default:
    llvm_unreachable("Do not know how to custom expand this result");
  }
}

SDValue DSPICTargetLowering::LowerExternalSymbol(SDValue Op,
                                                  SelectionDAG &DAG) const {
  SDLoc dl(Op);
  const char *Sym = cast<ExternalSymbolSDNode>(Op)->getSymbol();
  EVT PtrVT = Op.getValueType();
  SDValue Result = DAG.getTargetExternalSymbol(Sym, PtrVT);

  return DAG.getNode(DSPICISD::Wrapper, dl, PtrVT, Result);
}

SDValue DSPICTargetLowering::LowerBlockAddress(SDValue Op,
                                                SelectionDAG &DAG) const {
  SDLoc dl(Op);
  const BlockAddress *BA = cast<BlockAddressSDNode>(Op)->getBlockAddress();
  EVT PtrVT = Op.getValueType();
  SDValue Result = DAG.getTargetBlockAddress(BA, PtrVT);

  return DAG.getNode(DSPICISD::Wrapper, dl, PtrVT, Result);
}

// L1f-k (trellis session 92): the 32-bit tests ONE half decides, reduced before the compare is
// emitted so the i16 forms take them: against zero, EQ/NE is `ior lo,hi,[w15]` (Z from both
// halves, one word -- IORF16rr); the sign (`< 0`, `>= 0`, and InstCombine's `> -1`, `<= -1`) is
// bit 15 of the high half (L1f-g's `btst`/`btss`); a single-bit mask against zero picks its half
// (the i16 bit test then applies). Anything else stays a 32-bit compare for EmitCMP to split.
static void ReduceCmp32(SDValue &LHS, SDValue &RHS, ISD::CondCode &CC, const SDLoc &dl,
                        SelectionDAG &DAG) {
  if (LHS.getValueType() != MVT::i32 || !isa<ConstantSDNode>(RHS))
    return;
  auto Half = [&](SDValue V, unsigned I) {
    return DAG.getNode(ISD::EXTRACT_ELEMENT, dl, MVT::i16, V, DAG.getIntPtrConstant(I, dl));
  };
  bool Zero = isNullConstant(RHS), AllOnes = isAllOnesConstant(RHS);
  if ((Zero && (CC == ISD::SETLT || CC == ISD::SETGE)) ||
      (AllOnes && (CC == ISD::SETGT || CC == ISD::SETLE))) {
    LHS = Half(LHS, 1);
    RHS = DAG.getSignedConstant(Zero ? 0 : -1, dl, MVT::i16);
    return;
  }
  if (!Zero || (CC != ISD::SETEQ && CC != ISD::SETNE))
    return;
  if (LHS.getOpcode() == ISD::AND && LHS.hasOneUse()) {
    if (auto *M = dyn_cast<ConstantSDNode>(LHS.getOperand(1))) {
      uint64_t Mask = M->getZExtValue() & 0xffffffffu;
      if (isPowerOf2_64(Mask)) {
        unsigned I = (Mask >> 16) ? 1 : 0;
        LHS = DAG.getNode(ISD::AND, dl, MVT::i16, Half(LHS.getOperand(0), I),
                          DAG.getConstant(I ? (Mask >> 16) : Mask, dl, MVT::i16));
        RHS = DAG.getConstant(0, dl, MVT::i16);
        return;
      }
    }
  }
  LHS = DAG.getNode(ISD::OR, dl, MVT::i16, Half(LHS, 0), Half(LHS, 1));
  RHS = DAG.getConstant(0, dl, MVT::i16);
}

static SDValue EmitCMP(SDValue &LHS, SDValue &RHS, SDValue &TargetCC,
                       ISD::CondCode CC, const SDLoc &dl, SelectionDAG &DAG) {
  // FIXME: Handle bittests someday
  assert(!LHS.getValueType().isFloatingPoint() && "We don't handle FP yet");

  // FIXME: Handle jump negative someday
  DSPICCC::CondCodes TCC = DSPICCC::COND_INVALID;
  switch (CC) {
  default: llvm_unreachable("Invalid integer condition!");
  case ISD::SETEQ:
    TCC = DSPICCC::COND_E;     // aka COND_Z
    // Minor optimization: if LHS is a constant, swap operands, then the
    // constant can be folded into comparison.
    if (LHS.getOpcode() == ISD::Constant)
      std::swap(LHS, RHS);
    break;
  case ISD::SETNE:
    TCC = DSPICCC::COND_NE;    // aka COND_NZ
    // Minor optimization: if LHS is a constant, swap operands, then the
    // constant can be folded into comparison.
    if (LHS.getOpcode() == ISD::Constant)
      std::swap(LHS, RHS);
    break;
  case ISD::SETULE:
    std::swap(LHS, RHS);
    [[fallthrough]];
  case ISD::SETUGE:
    // Turn lhs u>= rhs with lhs constant into rhs u< lhs+1, this allows us to
    // fold constant into instruction.
    // (L1f-k: never past the type's maximum -- `x <= MAX` is not `x < MAX+1`)
    if (const ConstantSDNode *C = dyn_cast<ConstantSDNode>(LHS);
        C && !C->getAPIntValue().isMaxValue()) {
      LHS = RHS;
      RHS =
          DAG.getSignedConstant(C->getSExtValue() + 1, dl, C->getValueType(0));
      TCC = DSPICCC::COND_LO;
      break;
    }
    TCC = DSPICCC::COND_HS;    // aka COND_C
    break;
  case ISD::SETUGT:
    std::swap(LHS, RHS);
    [[fallthrough]];
  case ISD::SETULT:
    // Turn lhs u< rhs with lhs constant into rhs u>= lhs+1, this allows us to
    // fold constant into instruction.
    // (L1f-k: never past the type's maximum -- `x <= MAX` is not `x < MAX+1`)
    if (const ConstantSDNode *C = dyn_cast<ConstantSDNode>(LHS);
        C && !C->getAPIntValue().isMaxValue()) {
      LHS = RHS;
      RHS =
          DAG.getSignedConstant(C->getSExtValue() + 1, dl, C->getValueType(0));
      TCC = DSPICCC::COND_HS;
      break;
    }
    TCC = DSPICCC::COND_LO;    // aka COND_NC
    break;
  case ISD::SETLE:
    std::swap(LHS, RHS);
    [[fallthrough]];
  case ISD::SETGE:
    // Turn lhs >= rhs with lhs constant into rhs < lhs+1, this allows us to
    // fold constant into instruction.
    // (L1f-k: never past the type's maximum -- `x <= MAX` is not `x < MAX+1`)
    if (const ConstantSDNode *C = dyn_cast<ConstantSDNode>(LHS);
        C && !C->getAPIntValue().isMaxSignedValue()) {
      LHS = RHS;
      RHS =
          DAG.getSignedConstant(C->getSExtValue() + 1, dl, C->getValueType(0));
      TCC = DSPICCC::COND_L;
      break;
    }
    TCC = DSPICCC::COND_GE;
    break;
  case ISD::SETGT:
    std::swap(LHS, RHS);
    [[fallthrough]];
  case ISD::SETLT:
    // Turn lhs < rhs with lhs constant into rhs >= lhs+1, this allows us to
    // fold constant into instruction.
    // (L1f-k: never past the type's maximum -- `x <= MAX` is not `x < MAX+1`)
    if (const ConstantSDNode *C = dyn_cast<ConstantSDNode>(LHS);
        C && !C->getAPIntValue().isMaxSignedValue()) {
      LHS = RHS;
      RHS =
          DAG.getSignedConstant(C->getSExtValue() + 1, dl, C->getValueType(0));
      TCC = DSPICCC::COND_GE;
      break;
    }
    TCC = DSPICCC::COND_L;
    break;
  }

  TargetCC = DAG.getConstant(TCC, dl, MVT::i8);
  // L1f-k (trellis session 92): the 32-bit compare -- `cp lo,lo'` glued to `cpb hi,hi'`. The
  // borrow compare sets C/N/OV from the 32-bit difference and Z sticky, so every condition above
  // reads the pair as one compare (cc1 branches `leu` after `subb`: the same reliance). A
  // constant's halves fold (EXTRACT_ELEMENT of a constant is constant); a half beyond lit8 is
  // materialized by isel as any register operand is.
  if (LHS.getValueType() == MVT::i32) {
    auto Half = [&](SDValue V, unsigned I) {
      return DAG.getNode(ISD::EXTRACT_ELEMENT, dl, MVT::i16, V, DAG.getIntPtrConstant(I, dl));
    };
    SDValue Lo = DAG.getNode(DSPICISD::CMP, dl, MVT::Glue, Half(LHS, 0), Half(RHS, 0));
    return DAG.getNode(DSPICISD::CMPB, dl, MVT::Glue, Half(LHS, 1), Half(RHS, 1), Lo);
  }
  return DAG.getNode(DSPICISD::CMP, dl, MVT::Glue, LHS, RHS);
}


SDValue DSPICTargetLowering::LowerBR_CC(SDValue Op, SelectionDAG &DAG) const {
  SDValue Chain = Op.getOperand(0);
  ISD::CondCode CC = cast<CondCodeSDNode>(Op.getOperand(1))->get();
  SDValue LHS   = Op.getOperand(2);
  SDValue RHS   = Op.getOperand(3);
  SDValue Dest  = Op.getOperand(4);
  SDLoc dl  (Op);
  ReduceCmp32(LHS, RHS, CC, dl, DAG); // L1f-k

  // L1f-g (trellis session 87): a sign test against zero is a test of the top bit, and a bit
  // test can become the skip form (`btsc w0,#15 ; rcall`, 2 words for `cp0 ; bra ; rcall`'s
  // 3); as a plain branch the two are the same two words. The combiner spells a single-bit
  // test of bit 7 or 15 this way, so this is where the bit test is recovered.
  // InstCombine spells the same test `x > -1` / `x <= -1` (bits-dag.log): both forms are caught.
  bool SignLT = isNullConstant(RHS) && (CC == ISD::SETLT || CC == ISD::SETGE);
  bool SignGT = isAllOnesConstant(RHS) && (CC == ISD::SETGT || CC == ISD::SETLE);
  if ((SignLT || SignGT) &&
      (LHS.getValueType() == MVT::i8 || LHS.getValueType() == MVT::i16)) {
    EVT XVT = LHS.getValueType();
    bool Negative = CC == ISD::SETLT || CC == ISD::SETLE; // the branch when the top bit is set
    LHS = DAG.getNode(ISD::AND, dl, XVT, LHS,
                      DAG.getConstant(XVT == MVT::i8 ? 0x80 : 0x8000, dl, XVT));
    RHS = DAG.getConstant(0, dl, XVT);
    CC = Negative ? ISD::SETNE : ISD::SETEQ;
  }

  SDValue TargetCC;
  SDValue Flag = EmitCMP(LHS, RHS, TargetCC, CC, dl, DAG);

  return DAG.getNode(DSPICISD::BR_CC, dl, Op.getValueType(),
                     Chain, Dest, TargetCC, Flag);
}

SDValue DSPICTargetLowering::LowerSETCC(SDValue Op, SelectionDAG &DAG) const {
  SDValue LHS   = Op.getOperand(0);
  SDValue RHS   = Op.getOperand(1);
  SDLoc dl  (Op);

  // If we are doing an AND and testing against zero, then the CMP
  // will not be generated.  The AND (or BIT) will generate the condition codes,
  // but they are different from CMP.
  // FIXME: since we're doing a post-processing, use a pseudoinstr here, so
  // lowering & isel wouldn't diverge.
  bool andCC = isNullConstant(RHS) && LHS.hasOneUse() &&
               (LHS.getOpcode() == ISD::AND ||
                (LHS.getOpcode() == ISD::TRUNCATE &&
                 LHS.getOperand(0).getOpcode() == ISD::AND));
  ISD::CondCode CC = cast<CondCodeSDNode>(Op.getOperand(2))->get();
  ReduceCmp32(LHS, RHS, CC, dl, DAG); // L1f-k
  // L1f-k: the sign as a VALUE is the top bit shifted down (`lsr Wb,#15,Wd`, one word), its
  // complement one `xor #1` more -- never the five-word branch-select. Word width only (a byte
  // shift goes through the word form, where the high byte would shift in).
  if (LHS.getValueType() == MVT::i16 &&
      ((isNullConstant(RHS) && (CC == ISD::SETLT || CC == ISD::SETGE)) ||
       (isAllOnesConstant(RHS) && (CC == ISD::SETGT || CC == ISD::SETLE)))) {
    bool Negative = CC == ISD::SETLT || CC == ISD::SETLE;
    SDValue Bit = DAG.getNode(ISD::SRL, dl, MVT::i16, LHS, DAG.getConstant(15, dl, MVT::i16));
    if (!Negative)
      Bit = DAG.getNode(ISD::XOR, dl, MVT::i16, Bit, DAG.getConstant(1, dl, MVT::i16));
    return DAG.getZExtOrTrunc(Bit, dl, Op.getValueType());
  }
  // L1f-g (trellis session 87): a single-bit test as a VALUE. (x & 1<<k) != 0 is (x >> k) & 1
  // and == 0 is ((x ^ 1<<k) >> k) & 1 -- cc1's `bfext #k,#1` in one word (`xor #m` first for
  // == 0), which the .td selects from the shift-and-mask shape, from a register or from a
  // file place at word width. Never through the flags: the FLAG2BOOL form is three words.
  if (isNullConstant(RHS) && LHS.getOpcode() == ISD::AND &&
      (CC == ISD::SETNE || CC == ISD::SETEQ)) {
    if (auto *C = dyn_cast<ConstantSDNode>(LHS.getOperand(1))) {
      EVT XVT = LHS.getValueType();
      uint64_t M = C->getZExtValue() & (XVT == MVT::i8 ? 0xff : 0xffff);
      if (isPowerOf2_64(M)) {
        SDValue Sh = DAG.getNode(ISD::SRL, dl, XVT, LHS.getOperand(0),
                                 DAG.getConstant(Log2_64(M), dl, MVT::i16));
        SDValue Bit = DAG.getNode(ISD::AND, dl, XVT, Sh, DAG.getConstant(1, dl, XVT));
        if (CC == ISD::SETEQ)
          Bit = DAG.getNode(ISD::XOR, dl, XVT, Bit, DAG.getConstant(1, dl, XVT));
        return DAG.getZExtOrTrunc(Bit, dl, Op.getValueType());
      }
    }
  }
  SDValue TargetCC;
  SDValue Flag = EmitCMP(LHS, RHS, TargetCC, CC, dl, DAG);

  // L1f-b: a boolean is materialized through SELECT_CC (the Select pseudo's branch
  // diamond), never by reading SR — SR is a FILE register on dsPIC, not a W register, and
  // the inherited `SR >> 1 & 1` idiom printed `xor.w SR,w2,w2`, which no ALU form encodes.
  // The one-word forms (`bsw`, `btst`, the compare-and-skip family) are L1f-e's.
  (void)andCC;
  EVT VT = Op.getValueType();
  // L1f-e: the four equality/unsigned conditions are `bsw` flag-to-bool (4 words, cc1's
  // shape); the six order conditions stay the SELECT_CC branch-select (5 words). The
  // {flag,invert} imm: bit0 = flag (0=Z,1=C), bit1 = invert (the `btg`).
  unsigned Cond = TargetCC->getAsZExtVal();
  int Kind = -1;
  switch (Cond) {
  case DSPICCC::COND_NE: Kind = 0; break;        // bsw.z
  case DSPICCC::COND_E:  Kind = 0 | 2; break;    // bsw.z ; btg
  case DSPICCC::COND_HS: Kind = 1; break;        // bsw.c        (unsigned >=)
  case DSPICCC::COND_LO: Kind = 1 | 2; break;    // bsw.c ; btg  (unsigned <)
  default: break;
  }
  if (Kind >= 0)
    return DAG.getNode(DSPICISD::FLAG2BOOL, dl, VT,
                       DAG.getConstant(Kind, dl, VT), Flag);
  SDValue One  = DAG.getConstant(1, dl, VT);
  SDValue Zero = DAG.getConstant(0, dl, VT);
  SDValue Ops[] = {One, Zero, TargetCC, Flag};
  return DAG.getNode(DSPICISD::SELECT_CC, dl, Op.getValueType(), Ops);
}

SDValue DSPICTargetLowering::LowerSELECT_CC(SDValue Op,
                                             SelectionDAG &DAG) const {
  SDValue LHS    = Op.getOperand(0);
  SDValue RHS    = Op.getOperand(1);
  SDValue TrueV  = Op.getOperand(2);
  SDValue FalseV = Op.getOperand(3);
  ISD::CondCode CC = cast<CondCodeSDNode>(Op.getOperand(4))->get();
  SDLoc dl   (Op);
  // L1f-k: an i32 RESULT is the legalizer's to split into two i16 selects (this is only reached
  // for one through the operand path when the comparands are i32 too); the comparands may be i32.
  if (Op.getValueType() == MVT::i32)
    return SDValue();
  ReduceCmp32(LHS, RHS, CC, dl, DAG);

  SDValue TargetCC;
  SDValue Flag = EmitCMP(LHS, RHS, TargetCC, CC, dl, DAG);

  SDValue Ops[] = {TrueV, FalseV, TargetCC, Flag};

  return DAG.getNode(DSPICISD::SELECT_CC, dl, Op.getValueType(), Ops);
}

