robbym/llvm-project/llvm/lib/Target/DSPIC/DSPICISelLowering.cpp
SDValue DSPICTargetLowering::LowerSIGN_EXTEND(SDValue Op,
                                               SelectionDAG &DAG) const {
  SDValue Val = Op.getOperand(0);
  EVT VT      = Op.getValueType();
  SDLoc dl(Op);

  assert(VT == MVT::i16 && "Only support i16 for now!");

  return DAG.getNode(ISD::SIGN_EXTEND_INREG, dl, VT,
                     DAG.getNode(ISD::ANY_EXTEND, dl, VT, Val),
                     DAG.getValueType(Val.getValueType()));
}

SDValue
DSPICTargetLowering::getReturnAddressFrameIndex(SelectionDAG &DAG) const {
  MachineFunction &MF = DAG.getMachineFunction();
  DSPICMachineFunctionInfo *FuncInfo = MF.getInfo<DSPICMachineFunctionInfo>();
  int ReturnAddrIndex = FuncInfo->getRAIndex();
  MVT PtrVT = getFrameIndexTy(MF.getDataLayout());

  if (ReturnAddrIndex == 0) {
    // Set up a frame object for the return address.
    uint64_t SlotSize = PtrVT.getStoreSize();
    ReturnAddrIndex = MF.getFrameInfo().CreateFixedObject(SlotSize, -SlotSize,
                                                           true);
    FuncInfo->setRAIndex(ReturnAddrIndex);
  }

  return DAG.getFrameIndex(ReturnAddrIndex, PtrVT);
}

SDValue DSPICTargetLowering::LowerRETURNADDR(SDValue Op,
                                              SelectionDAG &DAG) const {
  MachineFrameInfo &MFI = DAG.getMachineFunction().getFrameInfo();
  MFI.setReturnAddressIsTaken(true);

  unsigned Depth = Op.getConstantOperandVal(0);
  SDLoc dl(Op);
  EVT PtrVT = Op.getValueType();

  if (Depth > 0) {
    SDValue FrameAddr = LowerFRAMEADDR(Op, DAG);
    SDValue Offset =
      DAG.getConstant(PtrVT.getStoreSize(), dl, MVT::i16);
    return DAG.getLoad(PtrVT, dl, DAG.getEntryNode(),
                       DAG.getNode(ISD::ADD, dl, PtrVT, FrameAddr, Offset),
                       MachinePointerInfo());
  }

  // Just load the return address.
  SDValue RetAddrFI = getReturnAddressFrameIndex(DAG);
  return DAG.getLoad(PtrVT, dl, DAG.getEntryNode(), RetAddrFI,
                     MachinePointerInfo());
}

SDValue DSPICTargetLowering::LowerFRAMEADDR(SDValue Op,
                                             SelectionDAG &DAG) const {
  MachineFrameInfo &MFI = DAG.getMachineFunction().getFrameInfo();
  MFI.setFrameAddressIsTaken(true);

  EVT VT = Op.getValueType();
  SDLoc dl(Op);  // FIXME probably not meaningful
  unsigned Depth = Op.getConstantOperandVal(0);
  SDValue FrameAddr = DAG.getCopyFromReg(DAG.getEntryNode(), dl,
                                         DSPIC::R4, VT);
  while (Depth--)
    FrameAddr = DAG.getLoad(VT, dl, DAG.getEntryNode(), FrameAddr,
                            MachinePointerInfo());
  return FrameAddr;
}

SDValue DSPICTargetLowering::LowerVASTART(SDValue Op,
                                           SelectionDAG &DAG) const {
  MachineFunction &MF = DAG.getMachineFunction();
  DSPICMachineFunctionInfo *FuncInfo = MF.getInfo<DSPICMachineFunctionInfo>();

  SDValue Ptr = Op.getOperand(1);
  EVT PtrVT = Ptr.getValueType();

  // Frame index of first vararg argument
  SDValue FrameIndex =
      DAG.getFrameIndex(FuncInfo->getVarArgsFrameIndex(), PtrVT);
  const Value *SV = cast<SrcValueSDNode>(Op.getOperand(2))->getValue();

  // Create a store of the frame index to the location operand
  return DAG.getStore(Op.getOperand(0), SDLoc(Op), FrameIndex, Ptr,
                      MachinePointerInfo(SV));
}

SDValue DSPICTargetLowering::LowerJumpTable(SDValue Op,
                                             SelectionDAG &DAG) const {
    JumpTableSDNode *JT = cast<JumpTableSDNode>(Op);
    EVT PtrVT = Op.getValueType();
    SDValue Result = DAG.getTargetJumpTable(JT->getIndex(), PtrVT);
    return DAG.getNode(DSPICISD::Wrapper, SDLoc(JT), PtrVT, Result);
}

/// getPostIndexedAddressParts - returns true by value, base pointer and
/// offset pointer and addressing mode by reference if this node can be
/// combined with a load / store to form a post-indexed load / store.
bool DSPICTargetLowering::getPostIndexedAddressParts(SDNode *N, SDNode *Op,
                                                      SDValue &Base,
                                                      SDValue &Offset,
                                                      ISD::MemIndexedMode &AM,
                                                      SelectionDAG &DAG) const {

  // L1f-f (trellis session 87): a plain load or store of i8/i16 whose pointer is then moved
  // by exactly the access width, either way: [Wn++] / [Wn--].
  auto *LS = cast<LSBaseSDNode>(N);
  if (auto *LD = dyn_cast<LoadSDNode>(N)) {
    if (LD->getExtensionType() != ISD::NON_EXTLOAD)
      return false;
  } else if (cast<StoreSDNode>(N)->isTruncatingStore())
    return false;
  EVT VT = LS->getMemoryVT();
  if (VT != MVT::i8 && VT != MVT::i16)
    return false;
  if (Op->getOpcode() != ISD::ADD && Op->getOpcode() != ISD::SUB)
    return false;
  auto *RHS = dyn_cast<ConstantSDNode>(Op->getOperand(1));
  if (!RHS)
    return false;
  int64_t C = RHS->getSExtValue();
  if (Op->getOpcode() == ISD::SUB)
    C = -C;
  int64_t W = VT == MVT::i16 ? 2 : 1;
  if (C != W && C != -W)
    return false;
  Base = Op->getOperand(0);
  Offset = DAG.getConstant(W, SDLoc(N), MVT::i16);
  AM = C > 0 ? ISD::POST_INC : ISD::POST_DEC;
  return true;
}

/// getPreIndexedAddressParts (L1f-f): a load or store whose address is `p +- width` and
/// whose moved pointer is used again: [++Wn] / [--Wn]. The combiner asks; it only forms the
/// node when the add has other uses, so a plain displacement stays [Wn+d].
bool DSPICTargetLowering::getPreIndexedAddressParts(SDNode *N, SDValue &Base,
                                                     SDValue &Offset,
                                                     ISD::MemIndexedMode &AM,
                                                     SelectionDAG &DAG) const {
  auto *LS = cast<LSBaseSDNode>(N);
  if (auto *LD = dyn_cast<LoadSDNode>(N)) {
    if (LD->getExtensionType() != ISD::NON_EXTLOAD)
      return false;
  } else if (cast<StoreSDNode>(N)->isTruncatingStore())
    return false;
  EVT VT = LS->getMemoryVT();
  if (VT != MVT::i8 && VT != MVT::i16)
    return false;
  SDValue Ptr = LS->getBasePtr();
  if (Ptr.getOpcode() != ISD::ADD && Ptr.getOpcode() != ISD::SUB)
    return false;
  auto *RHS = dyn_cast<ConstantSDNode>(Ptr.getOperand(1));
  if (!RHS)
    return false;
  int64_t C = RHS->getSExtValue();
  if (Ptr.getOpcode() == ISD::SUB)
    C = -C;
  int64_t W = VT == MVT::i16 ? 2 : 1;
  if (C != W && C != -W)
    return false;
  Base = Ptr.getOperand(0);
  Offset = DAG.getConstant(W, SDLoc(N), MVT::i16);
  AM = C > 0 ? ISD::PRE_INC : ISD::PRE_DEC;
  return true;
}

bool DSPICTargetLowering::isTruncateFree(Type *Ty1,
                                          Type *Ty2) const {
  if (!Ty1->isIntegerTy() || !Ty2->isIntegerTy())
    return false;

