robbym/llvm-project/llvm/lib/Target/DSPIC/DSPICISelLowering.cpp
  return (Ty1->getPrimitiveSizeInBits().getFixedValue() >
          Ty2->getPrimitiveSizeInBits().getFixedValue());
}

bool DSPICTargetLowering::isTruncateFree(EVT VT1, EVT VT2) const {
  if (!VT1.isInteger() || !VT2.isInteger())
    return false;

  return (VT1.getFixedSizeInBits() > VT2.getFixedSizeInBits());
}

bool DSPICTargetLowering::isZExtFree(Type *Ty1, Type *Ty2) const {
  // DSPIC implicitly zero-extends 8-bit results in 16-bit registers.
  return false && Ty1->isIntegerTy(8) && Ty2->isIntegerTy(16);
}

bool DSPICTargetLowering::isZExtFree(EVT VT1, EVT VT2) const {
  // DSPIC implicitly zero-extends 8-bit results in 16-bit registers.
  return false && VT1 == MVT::i8 && VT2 == MVT::i16;
}

//===----------------------------------------------------------------------===//
//  Other Lowering Code
//===----------------------------------------------------------------------===//

MachineBasicBlock *
DSPICTargetLowering::EmitInstrWithCustomInserter(MachineInstr &MI,
                                                  MachineBasicBlock *BB) const {
  unsigned Opc = MI.getOpcode();

  const TargetInstrInfo &TII = *BB->getParent()->getSubtarget().getInstrInfo();
  DebugLoc dl = MI.getDebugLoc();

  // L1e prog-space (session 89): expand the PSV-window read to cc1's sequence.
  if (Opc == DSPIC::PSVLD16) {
    MachineRegisterInfo &MRI = BB->getParent()->getRegInfo();
    Register Dst  = MI.getOperand(0).getReg();
    Register Off  = MI.getOperand(1).getReg();
    Register Page = MI.getOperand(2).getReg();
    Register Save  = MRI.createVirtualRegister(&DSPIC::GR16RegClass);
    Register Off2  = MRI.createVirtualRegister(&DSPIC::GR16RegClass);
    Register Page2 = MRI.createVirtualRegister(&DSPIC::GR16RegClass);
    BuildMI(*BB, MI, dl, TII.get(DSPIC::MOVFROMDSR), Save);
    BuildMI(*BB, MI, dl, TII.get(DSPIC::BTSTSC16), Off2).addReg(Off).addImm(15);
    BuildMI(*BB, MI, dl, TII.get(DSPIC::RLC16), Page2).addReg(Page);
    BuildMI(*BB, MI, dl, TII.get(DSPIC::MOVPAGDSR)).addReg(Page2);
    BuildMI(*BB, MI, dl, TII.get(DSPIC::MOVINDLD16), Dst).addReg(Off2);
    BuildMI(*BB, MI, dl, TII.get(DSPIC::MOVPAGDSR)).addReg(Save);
    MI.eraseFromParent();
    return BB;
  }

  // Session 90: the byte read -- raw (`mov.b`), zero-extended (`ze`) or sign-extended (`se`),
  // the extension in the windowed load itself.
  if (Opc == DSPIC::PSVLD8 || Opc == DSPIC::PSVLD8Z || Opc == DSPIC::PSVLD8S) {
    unsigned LdOpc = Opc == DSPIC::PSVLD8Z ? DSPIC::MOVINDLDZ8
                   : Opc == DSPIC::PSVLD8S ? DSPIC::MOVINDLDS8 : DSPIC::MOVINDLD8;
    MachineRegisterInfo &MRI = BB->getParent()->getRegInfo();
    Register Dst  = MI.getOperand(0).getReg();
    Register Off  = MI.getOperand(1).getReg();
    Register Page = MI.getOperand(2).getReg();
    Register Save  = MRI.createVirtualRegister(&DSPIC::GR16RegClass);
    Register Off2  = MRI.createVirtualRegister(&DSPIC::GR16RegClass);
    Register Page2 = MRI.createVirtualRegister(&DSPIC::GR16RegClass);
    BuildMI(*BB, MI, dl, TII.get(DSPIC::MOVFROMDSR), Save);
    BuildMI(*BB, MI, dl, TII.get(DSPIC::BTSTSC16), Off2).addReg(Off).addImm(15);
    BuildMI(*BB, MI, dl, TII.get(DSPIC::RLC16), Page2).addReg(Page);
    BuildMI(*BB, MI, dl, TII.get(DSPIC::MOVPAGDSR)).addReg(Page2);
    BuildMI(*BB, MI, dl, TII.get(LdOpc), Dst).addReg(Off2);
    BuildMI(*BB, MI, dl, TII.get(DSPIC::MOVPAGDSR)).addReg(Save);
    MI.eraseFromParent();
    return BB;
  }

  // L1f-e: the compare flag-to-bool, `bsw.z`/`bsw.c` + optional `btg`.
  if (Opc == DSPIC::FLAG2BOOL16) {
    // Distinct vregs per step: `bsw`/`btg` are two-address (the constraint is resolved by the
    // two-address pass), so the def and the tied use must be SEPARATE vregs here, not one
    // (else getVRegDef sees multiple defs).
    int64_t K = MI.getOperand(1).getImm();
    MachineRegisterInfo &MRI = BB->getParent()->getRegInfo();
    Register Dst = MI.getOperand(0).getReg();
    Register V0 = MRI.createVirtualRegister(&DSPIC::GR16RegClass);
    Register V1 = (K & 2) ? MRI.createVirtualRegister(&DSPIC::GR16RegClass) : Dst;
    BuildMI(*BB, MI, dl, TII.get(DSPIC::MOV16rc), V0).addImm(0);
    unsigned Bsw = (K & 1) ? DSPIC::BSWC16 : DSPIC::BSWZ16;
    BuildMI(*BB, MI, dl, TII.get(Bsw), V1).addReg(V0);
    if (K & 2)
      BuildMI(*BB, MI, dl, TII.get(DSPIC::BTG16i0), Dst).addReg(V1);
    MI.eraseFromParent();
    return BB;
  }

  // (L1f-f, session 87: a dead second copy of the L1f-e arm -- its first, one-vreg form --
  // stood here, shadowed by the corrected arm above; removed.)
  // The memcpy/memset row (session 87 post-close; the pointer-preservation fix, Fable review).
  // The `mov`/`clr [Wn++]` under `repeat` ADVANCES the pointer register by cnt elements, but the
  // machine model does not track that. So the loop must run on SCRATCH copies of the incoming
  // pointers, or a use of the pointer AFTER the copy reads the advanced value (`memcpy(d,s,8);
  // use(d)` called use(d+16)). The COPY coalesces away when the incoming pointer is dead, so this
  // is `repeat`+move when the pointer is dead (smaller than cc1) and copy+`repeat`+move when it is
  // live (the same size as cc1's restore). {byte} imm selects `.w` or `.b`.
  // The moving-pointer instruction must MODEL the advance (a tied writeback def), or LLVM, seeing
  // no def, coalesces the scratch copy away and the original pointer is corrupted anyway. So the
  // loop runs on scratch copies (SD/SS) with `MOV16pp`/`CLR16p` (L1f-f's writeback forms); the
  // writeback vregs are dead. The scratch copy coalesces away when the incoming pointer is dead.
  if (Opc == DSPIC::MEMCPYinline) {
    MachineRegisterInfo &MRI = BB->getParent()->getRegInfo();
    Register Dst = MI.getOperand(0).getReg(), Src = MI.getOperand(1).getReg();
    int64_t Cnt = MI.getOperand(2).getImm(), Byte = MI.getOperand(3).getImm();
    Register SD = MRI.createVirtualRegister(&DSPIC::GR16RegClass);
    Register SS = MRI.createVirtualRegister(&DSPIC::GR16RegClass);
    Register WbS = MRI.createVirtualRegister(&DSPIC::GR16RegClass);
    Register WbD = MRI.createVirtualRegister(&DSPIC::GR16RegClass);
    BuildMI(*BB, MI, dl, TII.get(TargetOpcode::COPY), SD).addReg(Dst);
    BuildMI(*BB, MI, dl, TII.get(TargetOpcode::COPY), SS).addReg(Src);
    BuildMI(*BB, MI, dl, TII.get(Byte ? DSPIC::MEMCPYrepB : DSPIC::MEMCPYrepW), WbS)
        .addReg(WbD, RegState::Define).addReg(SS).addReg(SD).addImm(Cnt - 1);
    MI.eraseFromParent();
    return BB;
  }
  if (Opc == DSPIC::MEMSETZinline) {
    MachineRegisterInfo &MRI = BB->getParent()->getRegInfo();
    Register Dst = MI.getOperand(0).getReg();
    int64_t Cnt = MI.getOperand(1).getImm(), Byte = MI.getOperand(2).getImm();
    Register SD = MRI.createVirtualRegister(&DSPIC::GR16RegClass);
    Register WbD = MRI.createVirtualRegister(&DSPIC::GR16RegClass);
    BuildMI(*BB, MI, dl, TII.get(TargetOpcode::COPY), SD).addReg(Dst);
    BuildMI(*BB, MI, dl, TII.get(Byte ? DSPIC::MEMSETrepB : DSPIC::MEMSETrepW), WbD)
        .addReg(SD).addImm(Cnt - 1);
    MI.eraseFromParent();
    return BB;
  }

  // L1f-f: the i32 shift by one -- the carry pair, adjacent, the carry never leaving it.
  if (Opc == DSPIC::SHL32x1 || Opc == DSPIC::SRL32x1 || Opc == DSPIC::SRA32x1) {
    Register Lo2 = MI.getOperand(0).getReg(), Hi2 = MI.getOperand(1).getReg();
    Register Lo = MI.getOperand(2).getReg(), Hi = MI.getOperand(3).getReg();
    if (Opc == DSPIC::SHL32x1) {
      BuildMI(*BB, MI, dl, TII.get(DSPIC::ADD16rr), Lo2).addReg(Lo).addReg(Lo);
      BuildMI(*BB, MI, dl, TII.get(DSPIC::ADDC16rr), Hi2).addReg(Hi).addReg(Hi);
    } else {
      BuildMI(*BB, MI, dl, TII.get(Opc == DSPIC::SRL32x1 ? DSPIC::LSR16r1 : DSPIC::ASR16r1), Hi2)
          .addReg(Hi);
      BuildMI(*BB, MI, dl, TII.get(DSPIC::RRC16r), Lo2).addReg(Lo);
    }
    MI.eraseFromParent();
    return BB;
  }

