robbym/llvm-project/llvm/lib/Target/DSPIC/DSPICISelLowering.cpp
  // L1f-d increment 4: the hardware divide, dividend to w0, the pair out of w0:w1.
  if (Opc == DSPIC::UDIVREM16 || Opc == DSPIC::SDIVREM16) {
    unsigned DivOpc = Opc == DSPIC::SDIVREM16 ? DSPIC::DIVSW : DSPIC::DIVUW;
    BuildMI(*BB, MI, dl, TII.get(TargetOpcode::COPY), DSPIC::R12)
        .addReg(MI.getOperand(2).getReg());
    BuildMI(*BB, MI, dl, TII.get(DSPIC::REPEATdiv));
    BuildMI(*BB, MI, dl, TII.get(DivOpc)).addReg(MI.getOperand(3).getReg());
    BuildMI(*BB, MI, dl, TII.get(TargetOpcode::COPY), MI.getOperand(0).getReg())
        .addReg(DSPIC::R12);
    BuildMI(*BB, MI, dl, TII.get(TargetOpcode::COPY), MI.getOperand(1).getReg())
        .addReg(DSPIC::R13);
    MI.eraseFromParent();
    return BB;
  }

  // L1f-d increment 3: the widening multiply, its pair fixed at w0:w1.
  if (Opc == DSPIC::SMULLOHI16 || Opc == DSPIC::UMULLOHI16) {
    unsigned MulOpc = Opc == DSPIC::SMULLOHI16 ? DSPIC::MULSSpair : DSPIC::MULUUpair;
    BuildMI(*BB, MI, dl, TII.get(MulOpc))
        .addReg(MI.getOperand(2).getReg())
        .addReg(MI.getOperand(3).getReg());
    BuildMI(*BB, MI, dl, TII.get(TargetOpcode::COPY), MI.getOperand(0).getReg())
        .addReg(DSPIC::R12);
    BuildMI(*BB, MI, dl, TII.get(TargetOpcode::COPY), MI.getOperand(1).getReg())
        .addReg(DSPIC::R13);
    MI.eraseFromParent();
    return BB;
  }

  assert((Opc == DSPIC::Select16 || Opc == DSPIC::Select8) &&
         "Unexpected instr type to insert");

  // To "insert" a SELECT instruction, we actually have to insert the diamond
  // control-flow pattern.  The incoming instruction knows the destination vreg
  // to set, the condition code register to branch on, the true/false values to
  // select between, and a branch opcode to use.
  const BasicBlock *LLVM_BB = BB->getBasicBlock();
  MachineFunction::iterator I = ++BB->getIterator();

  //  thisMBB:
  //  ...
  //   TrueVal = ...
  //   cmpTY ccX, r1, r2
  //   jCC copy1MBB
  //   fallthrough --> copy0MBB
  MachineBasicBlock *thisMBB = BB;
  MachineFunction *F = BB->getParent();
  MachineBasicBlock *copy0MBB = F->CreateMachineBasicBlock(LLVM_BB);
  MachineBasicBlock *copy1MBB = F->CreateMachineBasicBlock(LLVM_BB);
  F->insert(I, copy0MBB);
  F->insert(I, copy1MBB);
  // Update machine-CFG edges by transferring all successors of the current
  // block to the new block which will contain the Phi node for the select.
  copy1MBB->splice(copy1MBB->begin(), BB,
                   std::next(MachineBasicBlock::iterator(MI)), BB->end());
  copy1MBB->transferSuccessorsAndUpdatePHIs(BB);
  // Next, add the true and fallthrough blocks as its successors.
  BB->addSuccessor(copy0MBB);
  BB->addSuccessor(copy1MBB);

  BuildMI(BB, dl, TII.get(DSPIC::JCC))
      .addMBB(copy1MBB)
      .addImm(MI.getOperand(3).getImm());

  //  copy0MBB:
  //   %FalseValue = ...
  //   # fallthrough to copy1MBB
  BB = copy0MBB;

  // Update machine-CFG edges
  BB->addSuccessor(copy1MBB);

  //  copy1MBB:
  //   %Result = phi [ %FalseValue, copy0MBB ], [ %TrueValue, thisMBB ]
  //  ...
  BB = copy1MBB;
  BuildMI(*BB, BB->begin(), dl, TII.get(DSPIC::PHI), MI.getOperand(0).getReg())
      .addReg(MI.getOperand(2).getReg())
      .addMBB(copy0MBB)
      .addReg(MI.getOperand(1).getReg())
      .addMBB(thisMBB);

  MI.eraseFromParent(); // The pseudo instruction is gone now.
  return BB;
}
